[
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 272,
    "Name": "Composition and Argumentation for Engineers",
    "Credits": "3",
    "Description": "Fundamentals of English composition and argumentation: grammar; reasoning and persuasion; persuasive proofs; argumentation; structuring and outlining; the problem statement; the body; and the conclusions. Language and persuasion for effective communication in professional engineering. Cultivation of a writing style firmly based on clear and critical thinking skills.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "This course cannot be used for credit in any GCS degree or certificate program.",
      "Students who pass this course with C- or higher will fulfill the GCS writing skills requirement, and will be eligible to enrol in ENCS 282."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 282,
    "Name": "Technical Writing and Communication",
    "Credits": "3",
    "Description": "Technical writing form and style. Technical and scientific papers, abstracts, reports. Library research and referencing methods for engineers and computer scientists. Technical communication using information technology: document processing software, computer‑assisted presentation, analysis and design of web presentation, choice and use of appropriate tools. Students will prepare an individual major report and make an oral presentation",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 272"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 333,
    "Name": "Research Methods, Ethics, Law and Regulation for Computational Biology",
    "Credits": "3",
    "Description": "The course is comprised of three modules: Research Methods; Ethics; and Intellectual Property, Law and Regulation.",
    "Components": [
      "Lecture 1.5 hours per week, over two terms, fall and winter."
    ],
    "Notes": null,
    "Duration": 2,
    "Prerequisites": [
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 393,
    "Name": "Social and Ethical Dimensions of Information and Communication Technologies",
    "Credits": "3",
    "Description": "This course covers the following topics: ethics in an information society; surveillance and privacy; economic globalization and intellectual property in a digital world: the digital divide; computer-based profiling and hacking; electronic democracy; computer-mediated experience; and information productivity and the work/life balance.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 483,
    "Name": "Creativity, Innovation and Critical Thinking in Science and Technology",
    "Credits": "3",
    "Description": "Understanding, thinking, arguing, and creativity in science and technology; analyzing and critiquing complex problems using multidisciplinary theories of creativity; exploring the processes of invention and innovation and their impact on economics, popular media, and social and cultural structures; case studies of why some inventions fail and others succeed. Students will be evaluated on case studies, assignments, and a project.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for ENCS 283 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 484,
    "Name": "Development and Global Engineering",
    "Credits": "3",
    "Description": "International development and global engineering: globalization; development projects; planning and analysis; and participatory data gathering. A project.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ENCS 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 485,
    "Name": "Field Course in Engineering and Sustainable Development",
    "Credits": "3",
    "Description": "This is a complementary field course for undergraduate students interested in areas of international development and global engineering. The course consists of lectures at Concordia University followed by a trip to a designated location where development is underway. Topics include location and context‑specific history and evolution of development, globalization, sustainability initiatives, technological planning and analysis, and participatory data gathering. Students are required to complete a project‑based research paper on a topic approved by the course instructor.",
    "Components": [
      "Lecture",
      "Fieldwork"
    ],
    "Notes": [
      "Students from other Faculties may register for this course with permission from the course instructor."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENCS",
    "Number": 498,
    "Name": "Topics in Engineering and Computer Science",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Gina Cody School of Engineering and Computer Science. The course content may vary from offering to offering.",
    "Components": null,
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 108,
    "Name": "Engineering C.Edge Option Reflective Learning I",
    "Credits": "3",
    "Description": "This course is a reflective learning module for students in their related field which is based on their academic requirements and their first C.Edge term.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 201,
    "Name": "Professional Practice and Responsibility",
    "Credits": "1.5",
    "Description": "Health and safety issues for engineering projects: Quebec and Canadian legislation; safe work practices; general laboratory safety common to all engineering disciplines, and specific laboratory safety pertaining to particular engineering disciplines. Review of the legal framework in Quebec, particularly the Professional Code and the Engineers Act, as well as professional ethics.",
    "Components": [
      "Lecture 1.5 hours per week",
      "Tutorial 1 hour per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 202,
    "Name": "Sustainable Development and Environmental Stewardship",
    "Credits": "1.5",
    "Description": "Introduction to the concept of sustainable development and the approaches for achieving it. Relationships with economic, social, and technological development. Methods for evaluating sustainability of engineering projects, including utilization of relevant databases and software. Impact of engineering design and industrial development on the environment. Case studies.",
    "Components": [
      "Lecture 1.5 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 208,
    "Name": "Engineering C.Edge Option Reflective Learning II",
    "Credits": "3",
    "Description": "This course expands on the students’ second C.Edge term in their related field of study to further develop their knowledge and work‑related skills.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 108"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 213,
    "Name": "Applied Ordinary Differential Equations",
    "Credits": "3",
    "Description": "This course introduces Engineering students to the theory and application of ordinary differential equations. Definition and terminology, initial‑value problems, separable differential equations, linear equations, exact equations, solutions by substitution, linear models, orthogonal trajectories, complex numbers, form of complex numbers: powers and roots, theory: linear equations, homogeneous linear equations with constant coefficients, undetermined coefficients, variation of parameters, Cauchy‑Euler equation, reduction of order, linear models: initial value, review of power series, power series solutions, theory, homogeneous linear systems, solution by diagonalization, non‑homogeneous linear systems. Eigenvalues and eigenvectors.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MATH 204",
      "MATH 205"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 233,
    "Name": "Applied Advanced Calculus",
    "Credits": "3",
    "Description": "This course introduces Engineering students to the theory and application of advanced calculus. Functions of several variables, partial derivatives, total and exact differentials, approximations with differentials. Tangent plane and normal line to a surface, directional derivatives, gradient. Double and triple integrals. Polar, cylindrical, and spherical coordinates. Change of variables in double and triple integrals. Vector differential calculus; divergence, curl, curvature, line integrals, Green’s theorem, surface integrals, divergence theorem, applications of divergence theorem, Stokes’ theorem.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MATH 204",
      "MATH 205"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 242,
    "Name": "Statics",
    "Credits": "3",
    "Description": "Resultant of force systems; equilibrium of particles and rigid bodies; distributed forces; statically determinate systems; trusses; friction; moments of inertia; virtual work. Shear and bending moment diagrams.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213",
      "PHYS 204",
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 243,
    "Name": "Dynamics",
    "Credits": "3",
    "Description": "Kinematics of a particle and rigid body; forces and accelerations; work and energy; impulse and momentum; dynamics of a system of particles and rigid bodies, introduction to vibrations.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 242"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 244,
    "Name": "Mechanics of Materials",
    "Credits": "3.75",
    "Description": "This course covers the following topics: mechanical behaviour of materials; stress; strain; review of shear and bending moment diagrams; analysis and design of structural and machine elements subjected to axial, torsional, and flexural loadings; combined stresses and stress transformation; deflections; introduction to elastic stability and buckling behaviour.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 3 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213",
      "ENGR 242/ENGR 245",
      "ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 245,
    "Name": "Mechanical Analysis",
    "Credits": "3",
    "Description": "This course covers the following topics: forces in a plane and in space, moments of forces, rigid bodies in equilibrium, and free‑body diagram; centroids and centres of gravity; distributed forces and moments of inertia; principle of virtual work; kinematics of particles and rigid bodies; forces and accelerations; work and energy; kinetics of particles and rigid bodies.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "PHYS 204",
      "ENGR 213"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 251,
    "Name": "Thermodynamics I",
    "Credits": "3",
    "Description": "Basic principles of thermodynamics and their application to various systems composed of pure substances and their homogeneous non‑reactive mixtures. Simple power production and utilization cycles.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MATH 203"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 290,
    "Name": "Introductory Engineering Team Design Project",
    "Credits": "3",
    "Description": "The introductory team design project introduces students to teamwork, project management, engineering design for a complex problem, technical writing and technical presentation in a team environment. Students work in teams and each team designs and builds a prototype defined by the Department. Students present their design and demonstrate that their design works in a competition at the end of the term. The students are also introduced to the basic principles of mechanics including the description of translational motion, rotational motion, forces and moments, work and energy, and they build a mechanical prototype to which the electronics and software are then added. A significant team project is required in this course.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "All written documentation must follow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282",
      "ENGR 213/ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 301,
    "Name": "Engineering Management Principles and Economics",
    "Credits": "3",
    "Description": "Introduction to project delivery systems. Principles of project management; role and activity of a manager; enterprise organizational charts; cost estimating; planning and control. Company finances; interest and time value of money; discounted cash flow; evaluation of projects in private and public sectors; depreciation methods; business tax regulations; decision tree; sensitivity analysis.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 308,
    "Name": "Engineering C.Edge Option Reflective Learning III",
    "Credits": "3",
    "Description": "This course further expands on the students’ third C.Edge term in their related field of study to further develop their knowledge and work‑related skills.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 208"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 311,
    "Name": "Transform Calculus and Partial Differential Equations",
    "Credits": "3",
    "Description": "This course covers the following topics: the Laplace transforms and their application to the solution of ordinary differential equations; Fourier series; elements of partial differential equations; Fourier method of separation of variables for the solution of partial differential equations; the one-dimensional transient heat conduction parabolic equation; the one-dimensional wave hyperbolic equation; the two-dimensional Laplace elliptic equation.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 361,
    "Name": "Fluid Mechanics I",
    "Credits": "3",
    "Description": "Basic concepts and principles of fluid mechanics. Classification of fluid flow. Hydrostatic forces on plane and curved surfaces, buoyancy and stability, fluids in rigid body motion. Mass, momentum, and energy conservation integral equations. Bernoulli equation. Basic concepts of pipe and duct flow. Introduction to Navier‑Stokes equations. Similarity and model studies.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233/ENGR 251"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 371,
    "Name": "Probability and Statistics in Engineering",
    "Credits": "3",
    "Description": "Axioms of probability theory. Events. Conditional probability. Bayes theorem. Random variables. Mathematical expectation. Discrete and continuous probability density functions. Transformation of variables. Probabilistic models, statistics, and elements of hypothesis testing (sampling distributions and interval estimation). Introduction to statistical quality control. Applications to engineering problems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 391,
    "Name": "Numerical Methods in Engineering",
    "Credits": "3",
    "Description": "This course focuses on roots of algebraic and transcendental equations; function approximation; solution of simultaneous algebraic equations; interpolation; regression; introduction to machine learning; numerical differentiation; numerical integration; numerical solutions of ordinary differential equations and partial differential equations; reliability; conditioning; error analysis. Implementation using GNU Octave/MATLAB.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233",
      "COMP 248/COEN 243/MECH 215/MIAE 215/BCEE 231"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 392,
    "Name": "Impact of Technology on Society",
    "Credits": "3",
    "Description": "Social history of technology and of science including the industrial revolution and modern times. Engineering and scientific creativity, social and environmental problems created by uncontrolled technology, appropriate technology.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282",
      "ENGR 201/ENGR 202"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 411,
    "Name": "Special Technical Report",
    "Credits": "1",
    "Description": "Students must submit a report on a topic related to the students’ discipline and approved by the Department. The report must present a review of a current engineering problem, a proposal for a design project, or a current engineering practice.",
    "Components": [
      "Lecture"
    ],
    "Notes": [
      "Students who have received credit for ENGR 410 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 412,
    "Name": "Honours Research Project",
    "Credits": "3",
    "Description": "Students work on a research project in their area of concentration, selected in consultation with and conducted under the supervision of a faculty member of the Department. The student’s work must culminate in a final report, as well as an oral presentation. Students planning to register for this course should consult with the Department prior to term of planned registration. Intended for students with potential interest in graduate programs.",
    "Components": [
      "Research"
    ],
    "Notes": [
      "Must be approved by the Department prior to registration"
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 472,
    "Name": "Robot Manipulators",
    "Credits": "3.5",
    "Description": "Spatial descriptions and transformations. Manipulator forward and inverse kinematics. Jacobians: velocities and static forces. Manipulator dynamics. Trajectory generation. Position control of manipulators. Force control of manipulators. Robot programming languages.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 372/MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 490,
    "Name": "Multidisciplinary Capstone Design Project",
    "Credits": "6",
    "Description": "Students work on a supervised team project to solve a complex interdisciplinary design problem. The project is completed by a team of students from at least two different departments in Gina Cody School of Engineering and Computer Science. The project must provide clear goals for each discipline‑specific task and each student must have sufficient exposure to subjects in their program of study. Student eligibility and project topics for this course are subject to approval by the ENGR 490 Design Committee, which includes a member from each department in Gina Cody School of Engineering and Computer Science that offers undergraduate programs. This committee vets each project to ensure the clarity and scope of the goals and its relevance to the learning outcomes of students from each discipline. The project is carried out over both fall and winter terms. Students are expected to provide a preliminary project proposal, a progress and a final report (as a group); take part in group discussions in audit sessions during the design phase; and participate in a poster session involving individual oral presentations at the end of the winter term. In addition to the technical aspects, students are expected to learn how to evaluate their designs for compliance to regulations, environmental and societal expectations and economic issues. Students learn how to work in a multidisciplinary environment and receive exposure to entrepreneurial skills.",
    "Components": [
      "Lecture 1 hour per week, two terms",
      "Laboratory Equivalent time, 3 hours per week, two terms"
    ],
    "Notes": [
      "Students work in groups under direct supervision of a faculty member."
    ],
    "Duration": 2,
    "Prerequisites": [
      "AERO 490",
      "BLDG 490",
      "CIVI 490",
      "COEN 490",
      "ELEC 490",
      "INDU 490",
      "MECH 490",
      "COMP 490/SOEN 490"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ENGR",
    "Number": 498,
    "Name": "Topics in Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Gina Cody School of Engineering and Computer Science. The course content may vary from offering to offering.",
    "Components": null,
    "Notes": [
      "This course may be offered in a given year upon the authorization of the GCS."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 201,
    "Name": "Introduction to Flight and Aerospace Systems",
    "Credits": "4",
    "Description": "Introduction to flight vehicles in the atmosphere and in space; elements of aerodynamics, airfoils and wings; aerospace technologies including structures, materials and propulsion systems; elements of aircraft performance; basic principles of flight stability, control and systems integration; aspects of aircraft conceptual design.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 4 hours per week, alternate weeks"
    ],
    "Notes": [
      "Permission of the Department is required for non‑Aerospace Engineering students."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 290,
    "Name": "Introduction to Aircraft Design",
    "Credits": "3",
    "Description": "Students taking this course will work as part of a multidisciplinary team to solve an assigned aerospace conceptual design problem. The course provides introductory, design‑related knowledge on aerospace design topics including structural layout, powerplant integration, integrated systems requirements (such as avionics, electrical, flight controls, hydraulic, fuel, air, pressurization) and preliminary performance predictions. Lectures instruct students on the conceptual design process; aircraft sizing including take‑off weight, empty weight and fuel‑fraction estimates; mission analysis and trade studies; airfoil selection; constraint diagrams for thrust‑to‑weight and wing loading estimation; fuselage layout, engines and control surface sizing; structural and systems layout; introductory stability, control and performance; and cost analysis methods.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "AERO 201",
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 371,
    "Name": "Modelling and Control Systems",
    "Credits": "3.5",
    "Description": "Definition and classification of dynamic systems and components. Modelling of system components using ordinary differential equations: mechanical, electrical, electromechanical, and electrohydraulic subsystems in an airplane. Modelling of systems using transfer function models, block diagrams and signal flow graphs. Linearization of non‑linear systems. Transient and steady‑state characteristics of dynamic systems. Systems analyses using time domain methods, root‑locus methods, and frequency response methods. Characteristics and performance of linear feedback control systems. System stability. Proportional, integral and derivative controllers. Simulation technique using Matlab/Simulink.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "nbsp;",
      "Students who have received credit for ELEC 372 or MECH 371 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "PHYS 205",
      "ENGR 213/ENGR 243",
      "ENGR 311/ELEC 342/ELEC 364"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 390,
    "Name": "Aerospace Engineering Design Project",
    "Credits": "3",
    "Description": "This course focuses on general design philosophy and the design process. The following topics are covered: design factors such as product safety, reliability, life cycle costs and manufacturability; design in the aerospace context (vehicle and system design with regard to mission requirements, configuration, sizing, loads, etc.); mathematical modelling, analysis, and validation; introduction to Computer‑Aided Design and Engineering (CAD and CAE); design documentation. A team‑based project in which an aerospace system/subsystem is designed, implemented, documented and presented is an intrinsic part of this course.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "AERO 290/AERO 371",
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 417,
    "Name": "Standards, Regulations and Certification",
    "Credits": "3",
    "Description": "Overview of DoT and other international aviation standards (e.g. FAA), regulations and certification procedures; regulatory areas, namely, pilot training/testing, air traffic procedures, aircraft systems design and airworthiness; development process for new regulations and criteria for certification.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for ENGR 417 or for this topic under an ENGR 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 201"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 431,
    "Name": "Principles of Aeroelasticity",
    "Credits": "3.5",
    "Description": "This course covers the following topics: aerodynamic loading of elastic airfoils; phenomenon of divergence; effect of flexible control surface on divergence of main structure; divergence of one‑ and two‑ dimensional wing models; phenomenon of flutter; flutter of two‑ and three‑dimensional wings; flutter prevention and control; panel flutter in high‑speed vehicles, flutter of turbomachine bladings, galloping, vortex‑induced oscillations, bridge buffeting.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks."
    ],
    "Notes": [
      "Students who have received credit for MECH 431 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 361",
      "MECH 375"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 446,
    "Name": "Aerospace Vehicle Performance",
    "Credits": "3",
    "Description": "Introduction to fixed‑wing aircraft operation. Flying environment and its measurement by aircraft instrumentation. Computation of lift and drag, effects of viscosity and compressibility. Review of piston, turboprop, turbojet and turbofan power plants. Operational performance of aircraft in climb, cruise, descent and on ground. Advanced aircraft systems. Operational considerations in aircraft design. Projects on selected topics.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 455,
    "Name": "Computational Fluid Dynamics for Aerospace Applications",
    "Credits": "3.75",
    "Description": "Introduction to computational methods in fluid dynamics using commercial CFD codes; aspects of geometry modelling, structured and unstructured grid generation, solution strategy, and post‑processing; conversion of CAD to CFD models; an overview of basic numerical methods for the Navier‑Stokes equations with emphasis on accuracy evaluation and efficiency. Elements of turbulence closure modelling. User‑defined function for customized physical models into commercial CFD codes.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 3 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 311/ENGR 391",
      "MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 462,
    "Name": "Turbomachinery and Propulsion",
    "Credits": "3",
    "Description": "This course covers the following topics: review of the gas turbine cycle and components arrangement; turbo‑propulsion (turboprop, turbofan, turbojet and turboshafts); energy transfer in turbomachines (Euler equation, velocity triangles); dimensional analysis of turbomachines; flow in turbomachines; three‑dimensional flow in turbomachines; mechanisms of losses in turbomachines; axial‑flow turbines and compressors; centrifugal compressors; compressor and turbine performance maps; surge and stall.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "This course is equivalent to MECH 462. Students who have received credit for MECH 462 may not take this course for credit.",
      "Students who have received credit for MECH 468 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 351/MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 464,
    "Name": "Aerodynamics",
    "Credits": "3",
    "Description": "Flow conservation equations, incompressible Navier‑Stokes equations, inviscid irrotational and rotational flows: the Euler equations, the potential and stream function equations. Dynamics of an incompressible inviscid flow field: the Kelvin, Stokes, and Helmholtz theorems. Elementary flows and their superposition, panel method for non‑lifting bodies. Airfoil and wing characteristics, aerodynamic forces and moments coefficients. Incompressible flows around thin airfoils, Biot‑Savart law, vortex sheets. Incompressible flow around thick airfoils, the panel method for lifting bodies. Incompressible flow around wings, Prandtl’s lifting line theory, induced angle and down‑wash, unswept wings, swept wings. Compressible subsonic flow: linearized theory, Prandlt‑Glauert equation and other compressibility correction rules, the area rule. Transonic flow: Von Karman’s ransonic small disturbance equation, transonic full potential equation, super‑critical airfoils.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "This course is equivalent to MECH 464. Students who have received credit for MECH 464 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 465,
    "Name": "Gas Turbine Design",
    "Credits": "3.5",
    "Description": "Review of turbo‑propulsion types and energy transfer in turbomachines. Two‑ and three‑dimensional flow. Lift and drag for airfoils. Cascade tests and correlations. Aerodynamic losses: physics, mechanisms, control of viscous effects. Preliminary and detailed design of turbines and compressors. Structural and thermal design requirements. Failure considerations: creep, fatigue and corrosion. Performance matching. Combustion and gearbox design. Air and oil systems design requirements. Installations and acoustics. Evolution of design. Recent trends in technologies.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "This course is equivalent to MECH 465. Students who have received credit for MECH 465 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "AERO 462"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 471,
    "Name": "Aircraft Hydro‑Mechanical and Fuel Systems",
    "Credits": "3.5",
    "Description": "This course focuses on design principles and sizing of the following aircraft systems: hydraulic system, primary and secondary flight control actuation systems, landing gear systems, and fuel system. Traditional and new technology implementations in aircraft, helicopters and other aerospace vehicles are considered. Associated standards and regulations are described. Principles of architecture development and integration, as well as engineering tools for system sizing and simulation, are covered.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "AERO 201"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 472,
    "Name": "Aircraft Pneumatic and Electrical Power Systems",
    "Credits": "3.5",
    "Description": "This course focuses on design principles and sizing of the following aircraft systems: electrical power system, auxiliary and emergency power systems, environmental control system, ice and rain protection system, and pneumatic power system. Traditional and new technology implementations in aircraft, helicopters and other aerospace vehicles are considered. Associated standards and regulations are described. Principles of architecture development and integration, as well as engineering tools for system sizing and simulation, are covered. A project is required, including a laboratory component.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "AERO 201",
      "ENGR 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 480,
    "Name": "Flight Control Systems",
    "Credits": "3.5",
    "Description": "Basic flight control and flight dynamics principles. Aircraft dynamic equations and performance data. Implementation of aircraft control: control surfaces and their operations, development of thrust and its control; autopilot systems, their algorithms, dynamics and interaction problems. Flight instruments, principles of operation and dynamics. Cockpit layouts — basic configuration, ergonomic design, control field forces; advanced concepts in instruments, avionics and displays; HUD; flight management systems, and communication equipment. Introduction to flight simulation: overview of visual, audio and motion simulator systems; advanced concepts in flight simulators.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "This course is equivalent to ELEC 415 and to MECH 480. Students who have received credit for ELEC 415 or MECH 480 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "AERO 371/ELEC 372/MECH 371/SOEN 385"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 481,
    "Name": "Materials Engineering for Aerospace",
    "Credits": "3.5",
    "Description": "Different types of materials used in aerospace. Metals, composites, ceramics, polymers. Failure prediction and prevention. Modes of material failure, fracture, fatigue, creep, corrosion, impact. Effect of high temperature and multiaxial loadings. High temperature materials. Cumulative damage in fatigue and creep. Materials selection.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "This course is equivalent to MECH 481. Students who have received credit for MECH 481 may not take this course for credit.",
      "Students who have received credit for MECH 321 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 221/MIAE 221"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 482,
    "Name": "Avionic Navigation Systems",
    "Credits": "3",
    "Description": "Basics of modern electronic navigation systems, history of air navigation, earth coordinate and mapping systems; basic theory and analysis of modern electronic navigation instrumentation, communication and radar systems, approach aids, airborne systems, transmitters and antenna coverage; noise and losses, target detection, digital processing, display systems and technology; demonstration of avionic systems using flight simulator.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "This course is equivalent to ELEC 416 and to MECH 482. Students who have received credit for ELEC 416 or MECH 482 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 371/COMP 233",
      "AERO 371/ELEC 372/MECH 370/SOEN 385"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 483,
    "Name": "Integration of Avionics Systems",
    "Credits": "3",
    "Description": "This course covers the following topics: introduction to the basic principles of integration of avionics systems; review of Earth’s geometry and Newton’s laws; inertial navigation sensors and systems (INS); errors and uncertainty in navigation; Global Positioning System (GPS); differential and carrier tracking GPS applications; terrestrial radio navigation systems; Kalman filtering; integration of navigation systems using Kalman filtering; integration of GPS and INS using Kalman filtering.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "This course is equivalent to ENGR 418. Students who have received credit for ENGR 418 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "AERO 482",
      "ELEC 481"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 485,
    "Name": "Introduction to Space Systems",
    "Credits": "3",
    "Description": "Classification of space propulsion systems; Tsiolkovskj’s equation; ideal rocket and nozzle design; flight performance; basic orbital mechanics; chemical propellant rocket performance analysis; fundamentals of liquid and solid propellant rocket motors; electric, solar, fusion thruster.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "This course is equivalent to MECH 485. Students who have received credit for MECH 485 or for this topic under a MECH 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 351/MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 486,
    "Name": "Aircraft Stress Analysis",
    "Credits": "3",
    "Description": "Definition of load paths in typical aircraft structures. Derivation of analysis procedures to enable the designer to size preliminary designs. Internal shear flow distributions that balance external loads. Stress analysis of open and closed cell beams; statically indeterminate beams and frames; single and multi cell torque boxes; symmetric heavy fuselage frames. Structural instability of columns, beams, plates and flanges in compression and shear. Centres of twist and flexure; structural warping; margins of safety; concepts of optimum design; lug analysis and mechanical joints; matrix analysis methods leading to the Finite Element method. Stress analysis of thin‑walled metallic structures.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "This course is equivalent to MECH 486. Students who have received credit for MECH 486 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 243/ENGR 244"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 487,
    "Name": "Design of Aircraft Structures",
    "Credits": "3",
    "Description": "Design process for aircraft structures. Aero/performance aspects of aircraft structures. Airworthiness and design considerations. Materials. Static, vibratory and aeroelastic loadings. Propulsion‑induced loadings. Functions and fabrication of structural components. Design for buckling of aircraft structures: local buckling, instability of stiffened panels, flexural torsional buckling. Design for fracture and fatigue failures. Stress analysis and design of wings, fuselages, stringers, fuselage frames, wing ribs, cut‑outs in wings and fuselages, and laminated structures. Design using Finite Element Method. Concept of Optimum Design of Aircraft Structures. Design case studies.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "This course is equivalent to MECH 487. Students who have received credit for MECH 487 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "AERO 486"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "AERO",
    "Number": 490,
    "Name": "Capstone Aerospace Engineering Design Project",
    "Credits": "6",
    "Description": "This course includes a supervised design, simulation or experimental capstone design project including a preliminary project proposal with complete project plan and a technical report at the end of the fall term; a final report by the group and presentation at the end of the winter term.",
    "Components": [
      "Lecture 1 hour per week, one term",
      "Laboratory Equivalent time, 3 hours per week, two terms"
    ],
    "Notes": [
      "Students will work in groups under direct supervision of a faculty member.",
      "With permission of the Department, students may enrol in MECH 490 instead of AERO 490 on the condition that they choose to complete an aerospace‑oriented project."
    ],
    "Duration": 2,
    "Prerequisites": [
      "AERO 390",
      "ENGR 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 231,
    "Name": "Structured Programming and Applications for Building and Civil Engineers",
    "Credits": "3",
    "Description": "Elements of procedural programming: variables, primitive data types, scope, operators and expressions, control structures, functions, derived data types and basic data structures. Program structure and development: specifications, analysis of requirements, flow charting, incremental development, testing, validation and program documenting. Application of procedural programming, graphics and numerical tool box to mathematics and building, civil and environmental engineering.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MATH 204",
      "ENGR 242"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 342,
    "Name": "Structural Analysis I",
    "Credits": "3",
    "Description": "Analysis of statically determinate structures: deflections, strain energy concepts, virtual work principles. Mueller Breslau principle, influence lines. Approximate methods for statically indeterminate structures. Collapse load analysis. Cables and Arches. Computer applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 244"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 343,
    "Name": "Structural Analysis II",
    "Credits": "3",
    "Description": "Analysis of statically indeterminate structures: the methods of consistent deformations, slope deflection, and moment distribution. Application of virtual work principles. Introduction to matrix methods. Computer applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 342"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 344,
    "Name": "Structural Design of Steel and Wood Elements",
    "Credits": "3",
    "Description": "This course covers the following topics: basis for limit states design, code requirements, structural steel design: tension and compression members, beams and beam‑columns, connections, design of timber members.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 342"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 345,
    "Name": "Structural Design of Reinforced Concrete Elements",
    "Credits": "3",
    "Description": "This course covers the behaviour of reinforced concrete elements in flexure, compression, shear and bond. Other topics covered in the course are limit states design of reinforced concrete beams, one‑way slabs, columns, and footings; serviceability limits states; introduction to prestressed concrete and masonry structures.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 342"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 371,
    "Name": "Surveying",
    "Credits": "3",
    "Description": "Elementary operations employed in engineering surveying; use, care, and adjustment of instruments; linear and angular measurements; traversing; earthwork calculations; theory of errors; horizontal and vertical curves and curve layout; slope stakes and grades, application of surveying methods to city, topographic surveying, and introduction to advanced surveying techniques; use of digital computers in surveying calculations. Summer school taken before entering second year of study in the BEng program.",
    "Components": [
      "Lecture",
      "Fieldwork 8 hours per day",
      "6 days per week for 3 weeks."
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 212/CIVI 212"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 432,
    "Name": "Soil Mechanics",
    "Credits": "3.5",
    "Description": "This course covers the geological origin of soils, basic principles of physical geology with emphasis on topics related to soil mechanics; definition of the index properties and classification of soils and weight‑volume relationships; the characterization of soils structure and moisture‑density relationships; the definition of permeability, deformation, and strength of soils; the principle of total and effective stresses as related to soils; the characterization of steady stage seepage through isotropic soil media; the analysis of stress distribution due to external loads and evaluation of total settlements; brief outline of theory of consolidation; introduction to the fundamentals of stability of earth retaining walls, slopes, and footings.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 244"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 451,
    "Name": "Construction Engineering",
    "Credits": "3",
    "Description": "The nature of construction and the environment in which the industry works; organizational structures for project delivery; construction contracts and documents; introduction to construction processes: excavation and site works, foundation layout, concrete form design, concrete, steel, timber, and masonry construction; project planning, scheduling, and control; construction safety.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 341/CIVI 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 452,
    "Name": "Fundamentals of Finite Element Analysis of Structures",
    "Credits": "3",
    "Description": "Matrix formulation of the force and of the displacement methods of analysis. Direct stiffness approach; finite element methods for structural analysis. Truss, beam, plane strain, plane stress, shell and solid elements. Computer applications.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233",
      "BCEE 231/BCEE 343"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 455,
    "Name": "Introduction to Structural Dynamics",
    "Credits": "3",
    "Description": "Dynamic response of simple structural systems. Effects of blast, wind, traffic, and machinery vibrations. Basic concepts in earthquake resistant design. Computer applications.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 243/ENGR 391",
      "BCEE 342"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 464,
    "Name": "Project Cost Estimating",
    "Credits": "3",
    "Description": "Techniques and procedures used for estimating cost of construction projects. Cost estimation process; elements of project cost; conceptual and detailed cost estimation methods; risk assessment and range estimating; case studies; computer‑aided estimating.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 465,
    "Name": "Construction Planning and Control",
    "Credits": "3",
    "Description": "This course covers the following topics: methods of delivering construction, contractual relationships and organizational structures, phases of project development, estimating resource requirements, costs and durations, bidding strategies, network analysis using CPM and PERT, time‑cost trade‑off, resource allocation, cash flow analysis, earned‑value concept for integrated time and cost control, quality control, and value engineering.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 478"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 466,
    "Name": "Simulations and Design of Construction Operations",
    "Credits": "3",
    "Description": "Principles of modelling and simulation. Classification and validation of simulation models. Analysis of input data and outputs. Object Oriented Simulation (OOS). Simulation languages. Application of discrete event simulation in construction operations including earthmoving operations, building construction operations, and tunnelling operations.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 451"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 478,
    "Name": "Project Management for Construction",
    "Credits": "3",
    "Description": "This course introduces project management techniques in construction, including project delivery methods, construction contracts, cost estimating and bidding planning and scheduling, cash flow analysis, project tracking, control and computer applications.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BLDG 478 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "BLDG 341/CIVI 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 491,
    "Name": "Labour and Industrial Relations in Construction",
    "Credits": "3",
    "Description": "The study of labour legislation is covered, with special emphasis on the construction industry, union organization, the theory and practice of negotiations, mediation, contract administration, and arbitration. Moreover, the review of actual contracts and future trends are discussed.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BLDG 491 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 492,
    "Name": "Construction Processes",
    "Credits": "3",
    "Description": "This course is a study of current construction methods and techniques. The subjects include site preparation and earth‑work, wood framing, masonry, concrete forming, slip forming, precast construction, industrialized building, deep excavation shoring and underpinning. Other topics covered in the course are design, erection, and removal of temporary construction work, current field practice and safety considerations and site visits.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BLDG 492 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "BCEE 451/ENGR 451"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BCEE",
    "Number": 493,
    "Name": "Legal Issues in Construction",
    "Credits": "3",
    "Description": "Legal concepts and processes applicable to the development of constructed facilities and to the operation of the construction firm are covered. Emphasis is given to Quebec law and institutions.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BLDG 493 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 212,
    "Name": "Building Engineering Drawing and Introduction to Design",
    "Credits": "3",
    "Description": "Fundamentals of technical drawing, dimensioning practices, orthographic projections, auxiliary and sectional views of buildings. Theory and applications of descriptive geometry in building design. Computer‑aided building drawing. Building sub‑systems and related graphics standards; architectural and building engineering drawing at preliminary and final stages. Introduction to the design of light‑frame buildings. Project: representation of a building and its sub‑systems. Introduction to conceptual design.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 341,
    "Name": "Building Engineering Systems",
    "Credits": "3",
    "Description": "Introduction to systematic solution of building engineering problems. Techniques treated include linear programming, network analysis, nonlinear programming. Introduction to decision analysis and simulation. Application of optimization methods for solution of design problems in building science, building environment, building structures, and construction management, taking into account sustainability issues.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 231"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 365,
    "Name": "Building Science",
    "Credits": "3.5",
    "Description": "General introduction to the thermal environment and sustainable development issues. Topics include heat, temperature, one‑dimensional steady‑state processes. Convection: natural and forced. Radiation. Combined radiative and convective surface transfer. Psychrometrics. Thermal comfort. Air quality. Condensation: surface and interstitial. Introduction to compressible viscous flow, friction, and flow in pipes; boundary layer and wind effects.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 251"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 366,
    "Name": "Acoustics and Lighting",
    "Credits": "3.5",
    "Description": "General introduction to the aural and visual environment. Psychological impact of environment. Subjective and objective scales of measurement. Introduction to vibration. The hearing mechanism. Transmission of sound, passive control of noise in buildings, transmission loss, absorption and reverberation time. Room acoustic assessment. Active control of the aural environment. Visual perception. Photometry, brightness, luminance, and illumination. Concept of natural lighting in building. Artificial lighting; light sources; luminaries. Calorimetry. Calculation methods for artificial lighting.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 243"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 371,
    "Name": "Building Service Systems",
    "Credits": "3.5",
    "Description": "Principles of building service systems, including electrical, gas, communications, service‑water supply and distribution; introduction to plans, codes, and standards for utility distribution systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 365"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 390,
    "Name": "Building Engineering Design Project",
    "Credits": "3.5",
    "Description": "The project of each team will encompass various stages of design of a medium‑size building. Students learn building engineering design process, methodology, identification of objectives, building codes, formulation of design problems, and estimation of loads on buildings. The design topics encompass the development and evaluation of sustainable building design alternatives; conceptual building design of spatial requirements, design of space layout; and building design accounting for the synthesis and design of structures, enclosure systems, and services (HVAC, lighting, electrical distribution) using computer‑aided design tools. Additionally, performance evaluation using modelling, sensitivity analysis and cost estimation is presented.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 1 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 341",
      "ENCS 282",
      "BCEE 344"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 462,
    "Name": "Non-structural Building Materials",
    "Credits": "3",
    "Description": "This covers mechanical, thermal and non-traditional building materials such as: plastics, fibres, adhesives, sealants and coatings, plastic cellular foams, sandwich panels, composites, polymer and fibre-reinforced mortars, polymer and polymer composite membranes, water- resistive membrane and air and vapour control barriers. The degradation of materials is introduced, including the effects of actions due to corrosion, biological agents, heat and solar radiation, and thermal dilation. The application of materials and building products in buildings is demonstrated through the use of specifications, their performance assessment by testing, and relation to the building code.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 321"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 463,
    "Name": "Building Envelope Design",
    "Credits": "3",
    "Description": "Technical influences in the design of building envelope, including the control of heat flow, air and moisture penetration, building movements, and deterioration are covered. Other topics covered by the course are the application of air/ vapour barrier and rain‑screen systems, performance assessment and building codes through case studies and design projects, sustainable design principles, design of walls, roofs, joints and assemblies. Students also learn cause of deterioration and preventive measures, on‑site investigation and relevant building codes and standards.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 365"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 465,
    "Name": "Fire and Smoke Control in Buildings",
    "Credits": "3",
    "Description": "Topics treated include fire and smoke control; failure mechanisms of building enclosure illustrated by case studies; code requirements for enclosure systems; systems approach for fire safety.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 365"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 471,
    "Name": "HVAC System Design",
    "Credits": "4",
    "Description": "Principles of HVAC system design and analysis; sustainable design issues and impact on environment; component and system selection criteria including room air distribution, fans and air circulation, humidifying and dehumidifying processes, piping and ducting design. Air quality standards. Control systems and techniques; operational economics; computer applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 371",
      "BLDG 476"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 472,
    "Name": "Building Energy Conservation Technologies",
    "Credits": "3",
    "Description": "Standards of energy efficiency in buildings.Trends in energy consumption. Energy audit: evaluation of energy performance of existing buildings, weather normalization methods, measurements, disaggregation of total energy consumption, use of computer models, impact of people behaviour. Energy efficiency measures in buildings: approaches, materials and equipments, operating strategies, evaluation methods of energy savings. Renewable energy sources: passive or active solar systems, geothermal systems, free‑cooling. Optimum selection of energy sources. Impact of emerging technologies. Case studies.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 471"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 473,
    "Name": "Building Acoustics",
    "Credits": "3",
    "Description": "Noise control criteria and regulations, instrumentation, noise sources, room acoustics, walls, barriers and enclosures, acoustical materials and structures, vibration and noise control systems for buildings.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 366"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 474,
    "Name": "Building Illumination and Daylighting",
    "Credits": "3",
    "Description": "Production, measurement and control of light. Photometric quantities, visual perception and colour theory. Daylight and artificial illumination systems. Radiative transfer, fixture and lamp characteristics, control devices and energy conservation techniques. Design of lighting systems. Solar energy utilization and daylighting. Integration of lighting systems with mechanical systems for energy conservation and sustainable development.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 366"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 475,
    "Name": "Indoor Air Quality",
    "Credits": "3",
    "Description": "Elements of indoor air quality, physical/ chemical characteristics of contaminants, health effects, standard requirements. Estimation of the levels of indoor air contaminants in buildings. Design of ventilation systems for pollutant control. Air pollution due to outdoor air supply through ventilation systems. Effect of outdoor air pollution on indoor air quality.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 476,
    "Name": "Thermal Analysis of Buildings",
    "Credits": "3",
    "Description": "Two‑ and three‑dimensional steady‑state and transient conductive heat transfer together with convection and radiation as applied to building materials and geometries. Heating and cooling load analysis, including building shapes, construction type, solar radiation, infiltration, occupancy effects, and daily load variations. Computer applications for thermal load analysis. Introduction to heat exchangers.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 365",
      "ENGR 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 477,
    "Name": "Control Systems in Buildings",
    "Credits": "3",
    "Description": "Introduction to automatic control systems. Control issues related to energy conservation, indoor air quality and thermal comfort in buildings. Classification of HVAC control systems. Control system hardware: selection and sizing of sensors, actuators and controllers. Practical HVAC control systems; elementary local loop and complete control systems. Designing and tuning of controllers. Building automation systems. Case studies.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 479,
    "Name": "Commissioning of HVAC Systems in Buildings",
    "Credits": "3",
    "Description": "This course covers the following topics: introduction; scope of commissioning of Heating, Ventilating and Air Conditioning (HVAC) systems including commissioning, retro‑commissioning, recommissioning, continuous commissioning, and ongoing commissioning; process vs. technical commissioning; instrumentation for the monitoring of HVAC operation and performance; uncertainty analysis of experimental data; mathematical models of different classes of virtual sensors; data mining techniques applied to measurements from HVAC systems; development of benchmarking models of the normal HVAC operation including correlation‑based models, Artificial Neural Networks, and calibrated models; methods for the automated faults detection and diagnostic (FDD); forecasting models of the energy demand in buildings; recommissioning measures for HVAC systems; methods of estimation of energy and cost savings due to the commissioning of HVAC systems.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 471"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 480,
    "Name": "Building Information Modelling in Construction",
    "Credits": "3",
    "Description": "This course covers the following topics: introduction to Building Information Modelling (BIM) technologies; BIM implementation at different project stages (pre‑construction, construction, and facility management); BIM‑Aided design alternatives (constructability analysis, and development of space‑time‑cost models); BIM for visualization (trade coordination and processes monitoring). A project is required.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 481,
    "Name": "Fundamentals of Facility Management",
    "Credits": "3",
    "Description": "The course provides a study of the fundamental practices concomitant with facility management. The subjects include facility management industry backgrounds, management of outsourced services, financial analysis, asset management as it relates to building systems and controls. The course has a focus on sustainability, finance, maintenance and operations of facilities and considers solutions to facility management challenges.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 482,
    "Name": "Impact of Technology on Society and Architecture",
    "Credits": "3",
    "Description": "History of architecture as the confluence of social and technological evolution. Methodology and thought processes in the theory and design of cities and the human habitat. Impact of technology on society. Energy conservation, environmental constraints and sustainability issues.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 483,
    "Name": "Integrated Solar Systems: Design and Operation",
    "Credits": "3",
    "Description": "This course covers the following topics: energy modelling; analysis and design of solar buildings with passive and hybrid building‑integrated systems; and photovoltaic systems. Students learn both fundamentals and applications, including use of software in Mathcad, TRNSYS and Retscreen. A project is required.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 484,
    "Name": "Diagnostics and Rehabilitation of Building Envelope",
    "Credits": "3",
    "Description": "This course covers the following topics: modes of failures including wood decay, mould growth, freeze‑thaw, corrosion, chemical reaction, and movements; common failures in building envelopes including contemporary and traditional walls, windows, roofs and below‑grade structures; performance assessment protocols including diagnostics procedures, laboratory and field test methods; remedy strategies and maintenance plan; relevant building codes and standards. A project is required.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BLDG 463"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 490,
    "Name": "Capstone Building Engineering Design Project",
    "Credits": "4",
    "Description": "The project of each team encompasses the integrated design of at least three sub‑systems of a new or retro‑fitted building to achieve high performance and efficiency at reasonable cost; sustainable design and environmental impact issues are addressed in all projects. In the process, students learn, through case studies and literature survey, the information gathering and decision/design process, problem‑resolution as well as aspects related to management, teamwork and communication. Students registering for this course must contact the course coordinator for the detailed procedure.",
    "Components": [
      "Lecture 2 hours per week, two terms"
    ],
    "Notes": [
      "This course may be taken multiple times for credit."
    ],
    "Duration": 2,
    "Prerequisites": [
      "ENCS 282",
      "BCEE 344/BCEE 345",
      "BLDG 371/BLDG 390",
      "ENGR 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "BLDG",
    "Number": 498,
    "Name": "Topics in Building Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Department. The course content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 212,
    "Name": "Civil Engineering Drawing and Introduction to Design",
    "Credits": "3",
    "Description": "Fundamentals of technical drawing, orthographic projections, sectional views. Computer‑aided drawing; slabs, beams, and columns; steel structures; building trusses and bridges, wood and masonry structures. Working drawing and dimensioning practice. Introduction to the design process.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 231,
    "Name": "Geology for Civil Engineers",
    "Credits": "3",
    "Description": "Basic principles of physical and structural geology with emphasis on topics related to civil engineering, study of minerals, rocks and soil types, load formation, techniques of air‑photo interpretations, and geological mapping. Geological site investigation. Preparation and interpretation of engineering geology reports.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 321,
    "Name": "Engineering Materials",
    "Credits": "3.75",
    "Description": "Linear and nonlinear material behaviour, time‑dependent behaviour; structural and engineering properties of structural metals; behaviour of wood; production and properties of concrete; bituminous materials, ceramics, plastics; introduction to composite materials.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 3 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CHEM 205"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 341,
    "Name": "Civil Engineering Systems",
    "Credits": "3",
    "Description": "Development of concepts and techniques commonly associated with systems engineering which are applicable to design and operation of systems that concern civil engineers. Design and planning process; problem formulation, optimization concepts, linear programming, decision analysis; system simulation; network planning and project scheduling; computer applications. The techniques developed are used to solve problems in transportation, water resources, structures, and construction management.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 231"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 361,
    "Name": "Introduction to Environmental Engineering",
    "Credits": "3.5",
    "Description": "Ecosystems considerations, food chain, natural decomposition, and recycling; environmental problems and impact of engineering activities. Various modes of pollution, water, air, and soil contamination, noise pollution; pollution measurement and quantification. Water and waste‑water physical, chemical and biological characteristics; turbidity and colour, dissolved oxygen, hardness, pH, alkalinity, organic content, sampling and analysis, chemical and biochemical oxygen demand. Basic processes of treatment: flocculation and coagulation, sedimentation, filtration.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week, alternate week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 372,
    "Name": "Transportation Engineering",
    "Credits": "3",
    "Description": "Fields of transportation engineering; transportation’s roles in society; planning and design of road, rail, air, and water‑way system components: terminals, right‑of‑way; control systems: evaluation of alternative modes and decision‑making process; introduction to computer‑aided design and management of systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 371",
      "CIVI 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 381,
    "Name": "Hydraulics",
    "Credits": "3.5",
    "Description": "Basic hydrodynamics; boundary layer theory, principle of energy losses. Steady flow in open channel; uniform flow, specific energy and critical flow, transition; gradually varied flow in channels and conduits, water surface profiles, computer applications. Flow measurement in open channel, weirs, overflow spillways.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 361/ENGR 391"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 382,
    "Name": "Water Resources Engineering",
    "Credits": "3.5",
    "Description": "Sources of water: surface water, groundwater, water quantities and requirements. Water use cycle. Characteristics of water and wastewater. Demand forecast, water use prediction and planning. Groundwater withdrawal and well hydraulics. Water supply network analysis, design of distribution systems, storage, pumping. Sanitary and storm water quantities, urban hydrology. Design of sewer systems, interceptors, gravity sewer, computer applications. Sustainable use of water resources. Design case studies.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 381",
      "ENGR 391/EMAT 391"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 390,
    "Name": "Civil Engineering Design Project",
    "Credits": "3.5",
    "Description": "The project of each team encompasses the various stages of design of a medium-size civil engineering project. Students learn civil engineering design process, methodology, identification of objectives, codes, formulation of design problems, and estimation of loads on structures. The topics of design include the development and evaluation of sustainable design alternatives; and the computer-aided design tools. Additionally, performance evaluation using modelling, sensitivity analysis, and cost estimation is presented.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282",
      "CIVI 361",
      "BCEE 344",
      "BCEE 345"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 435,
    "Name": "Foundation Design",
    "Credits": "3",
    "Description": "This course covers the following: site investigation; shallow and deep foundations; bearing capacity and settlement of foundations; earth‑retaining structures; sheet piles; cofferdams; anchors; foundations subjected to dynamic loading; foundations on difficult soils; soil improvement and underpinning.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 432"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 437,
    "Name": "Advanced Geotechnical Engineering",
    "Credits": "3",
    "Description": "Mechanical properties of rocks and rock formations. Underground openings in rocks. Slope stability of stratified formations. Foundations on rocks. Rock bolting. Introduction of soil dynamics. Wave propagation in one and two dimensions in elastic media. Seismic waves. Foundations subjected to dynamic loading. Theory of liquefaction.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 432"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 440,
    "Name": "Computer Applications in Civil Engineering Practice",
    "Credits": "3",
    "Description": "General purpose IT tools for civil engineering applications: database programming and web‑based tools. Introduction to remote sensing and GIS. Application of major software packages in selected areas of civil engineering practice with emphasis on modelling, data integration, and work‑flow. Case studies in structural design, geotechnical engineering, transportation, and environmental engineering.",
    "Components": [
      "Lecture 2 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 231"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 453,
    "Name": "Design of Reinforced Concrete Structures",
    "Credits": "3.5",
    "Description": "This course covers a wide variety of topics on reinforced concrete including two‑way slab systems (flat plate, flat slab and slab‑on‑beams); slender columns; columns subjected to biaxial bending; lateral loads resisting systems (moment‑resisting frames, shear walls and coupled shear walls); prestressed concrete (losses, design requirements for flexure, shear, bond, anchorage and deflections). Design project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 345",
      "CIVI 390/BLDG 390"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 454,
    "Name": "Design of Steel Structures",
    "Credits": "3.5",
    "Description": "This course covers a wide variety of topics on steel structures: trends and developments in structural‑steel design, framing systems, floor systems such as composite construction and plate girders, braced frames, and moment‑resisting frames. The subject includes connections and P‑Delta effects. A design project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 344",
      "CIVI 390/BLDG 390"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 464,
    "Name": "Environmental Impact Assessment",
    "Credits": "3",
    "Description": "Engineering activities and the environment; environmental ethics. Prediction and estimation of impact on air, water, soil quality, and biological, socio-economic, cultural environments. Water and air pollution laws, solid and hazardous waste laws.Environmental inventories, assessment preparation, and review. Federal and provincial laws and regulations on environmental assessment. Strategies for environmental compliance, resolution of environmental conflicts. Case studies.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 465,
    "Name": "Water Pollution and Control",
    "Credits": "3.5",
    "Description": "Physical, chemical, and biological characteristics of water, water quality standards, reaction kinetics and material balances, eutrophication. Containment of reactive contaminants. Natural purification processes in water systems, adsorption, absorption; diffusion and dispersion, oxidation. Large‑scale transport of contaminants, single and multiple source models; modelling of transport processes, computer simulation. Introduction to ground‑water pollution, sea‑water intrusion.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 466,
    "Name": "Engineering Aspects of Chemical and Biological Processes",
    "Credits": "3",
    "Description": "Introduction to water purification, chemical treatment, coagulation, disinfection, special purification methods. Primary and secondary waste‑water treatment, solution and surface chemistry, microbiological consideration; reaction kinetics, diffusion processes, membrane processes, re‑aeration. Biological treatment, activated sludge process, treatment and disposal; biological reactors; aerated lagoons; trickling filter; biological nutrient removal. Tertiary waste‑water treatment.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 467,
    "Name": "Air Pollution and Emission Control",
    "Credits": "3",
    "Description": "Types of air pollutants. Sources of air pollutants, effects of air pollutants on health, vegetation, materials, and the atmosphere; emission standards. Meteorological considerations, dispersion of pollutants in the atmosphere, distribution and cleansing of particle matter, atmospheric photochemical reactions. Particulate pollutant control, source correction, cooling treatment; control of gaseous pollutant, point sources, odour control; measurement techniques; computer applications.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 468,
    "Name": "Waste Management",
    "Credits": "3",
    "Description": "Solid waste; source and generation, sampling and analysis, collection, transport, and storage. Waste recycling, physical and chemical reduction; drying; energy recovery; disposal of solid waste. Sanitary and secure landfill planning, site selection, design and operation; chemical and biological reactions. Hazardous waste, chemical and physical characteristics, handling, processing, transportation, and disposal. Resource recovery alternatives, material exchanges, hazardous waste management facilities, incinerators, landfills.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 469,
    "Name": "Geo‑Environmental Engineering",
    "Credits": "3.5",
    "Description": "Structure and surface chemistry of soil, ion exchange, hydrolysis equilibrium, adsorption. Biochemical degradation, toxic contaminants. Mechanical and thermodynamic equilibrium in soil. Geotechnical considerations in environmental design; soil decontamination. Barrier technologies and soil interaction. Landfill covers and leachate collection systems; subsurface investigation, soil‑gas survey.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 471,
    "Name": "Highway and Pavement Design",
    "Credits": "3",
    "Description": "This course covers the following topics: design criteria, including capacity and level of service, route alignment and right‑of‑way considerations, geometric design, earthworks and construction practices; pavement materials and tests; flexible and rigid pavement design procedures including subgrade, base, and surfacing characteristics, loads, stresses in pavement systems, material characterization, pavement response models, effects of natural forces, and construction practices; pavement management; computer applications; geometric and pavement design projects.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "BCEE 371",
      "CIVI 321"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 474,
    "Name": "Transportation Planning and Design",
    "Credits": "3",
    "Description": "Transportation planning process; data collection and demand analysis; trip generation, trip distribution, modal split and route assignment; forecasting travel patterns. Design of transportation facilities: street sections, intersections, and parking areas. Computer applications and design projects.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 483,
    "Name": "Hydrology",
    "Credits": "3",
    "Description": "Weather elements; precipitation, stage‑discharge relations; evapo‑transpiration; ground‑water flow; stream‑flow hydrography, unit hydrography, synthetic hydrographs; laminar flow; hydrologic routing; instantaneous hydrograph; hydraulic routing, method of characteristics, kinematic routing; statistical analysis, confidence intervals, stochastic generator, autoregressive model; applications of hydrology.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 381"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 484,
    "Name": "Hydraulic Engineering",
    "Credits": "3.5",
    "Description": "Development of surface water resource; basic measurements in hydraulic engineering; storage reservoirs; practical problems; run‑off characteristics of natural steams; probabilistic models; control structures; economic analysis; production function; project optimization; energy dissipators; sediment transportation; elements of river engineering; navigation; control of floods; computer modelling application. Design examples.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CIVI 381"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 490,
    "Name": "Capstone Civil Engineering Design Project",
    "Credits": "4",
    "Description": "The project of each team will encompass the integrated design of at least two sub‑disciplines of civil engineering to achieve high performance at reasonable cost. Through case studies and literature survey, students learn the information gathering and decision/design process, problem resolution, and aspects related to management, teamwork, and communication. Students registering for this course must contact the course coordinator for the detailed procedure.",
    "Components": [
      "Lecture 2 hours per week, two terms"
    ],
    "Notes": [
      "Students will work in groups under direct supervision of a faculty member."
    ],
    "Duration": 2,
    "Prerequisites": [
      "ENGR 301",
      "CIVI 361/CIVI 390",
      "BCEE 344/BCEE 345"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "CIVI",
    "Number": 498,
    "Name": "Topics in Civil Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the recommendation of the Department and approval of GCS Council. The course content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 212,
    "Name": "Digital Systems Design I",
    "Credits": "3.5",
    "Description": "Modulo arithmetic: representations of numbers in binary, octal and hexadecimal formats; binary arithmetic. Boolean algebra; theorems and properties, functions, canonical and standard forms. Logic gates and their use in the realization of Boolean algebra statements; logic minimization, multiple output circuits. Designing with MSI and LSI chips, decoders, multiplexers, adders, multipliers, programmable logic devices. Introduction to sequential circuits; flip‑flops. Completely specified sequential machines. Machine equivalence and minimization. Implementation of clock mode sequential circuits.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is equivalent to COEN 312. Students who have received credit for COEN 312 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 231,
    "Name": "Introduction to Discrete Mathematics",
    "Credits": "3",
    "Description": "Fundamentals of logic: basic connectives and truth tables; logical equivalence; the laws of logic; logical implication; rules of inference; the use of quantifiers; proofs of theorems. Sets: the laws of set theory. Boolean algebra. Relation of Boolean algebra to logical and set theoretic operations. Modulo arithmetic: division algorithm. Induction and recursion: induction on natural numbers; recursive definitions. Functions and relations: cartesian products and relations; functions; function composition and inverse functions; equivalence relations. Elements of graph theory: basic definitions of graph theory; paths, reachability and connectedness; computing paths from their matrix representation; traversing graphs represented as adjacency lists; trees and spanning trees. Finite‑state machines (FSM) deterministic and nondeterministic machines; regular languages; FSM with output; composition of FSM.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 243,
    "Name": "Programming Methodology I",
    "Credits": "3.5",
    "Description": "This course is an introduction to computers and programming paradigms. Essential topics from procedural programming languages are discussed such as key elements, reserved words and identifiers, data types and declarations, statements, arithmetic expressions, and different modes of execution. The course covers flow control using If-Else and Switch statements, repetition using loops, recursive functions, pointers, references and dynamic data structures and function pointer. The course material also includes Lambda expression, data structures, built-in arrays, template arrays and vectors, n‑dimensional vectors, sorting and searching. Students learn object‑oriented programming, user‑defined classes, class attributes and methods, object creation, use and destruction. Students are also introduced to exception handling and UML class diagrams.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for COMP 248, MIAE 215 or MECH 215 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 244,
    "Name": "Programming Methodology II",
    "Credits": "3",
    "Description": "This course covers advanced topics in computer programming. The course reviews object‑oriented programming and further concepts, and revisits pointers. The following topics are covered: operator overloading (regular and advanced usage), fundamentals of file and stream processing. The course also covers class composition and inheritance (regular and advanced usage), virtual functions, polymorphism, static and dynamic binding and abstract classes. A case study of a small‑scale object‑oriented project along with simplified analysis, design and implementation are discussed. Other topics in the course include files and streams, exception handling (advanced usage), templates (class templates, template instantiation and type binding), sequence containers and STL algorithms, UML modelling and an introduction to open software repository.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for COMP 249 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 243/MECH 215/MIAE 215"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 311,
    "Name": "Computer Organization and Software",
    "Credits": "3.5",
    "Description": "First, introduction and terminologies are presented. A review on data representation including fixed point and floating‑point formats and arithmetic operations are given. Next, the students get familiar with basic components of a processor. This includes Arithmetic and Logical Unit (ALU), registers, memory, Input/Output (I/Os) devices and bus. The addressing modes, instructions encoding and instruction execution steps and their relationship with the hardware are explained. Next, arithmetic, logical, shift/rotate, control and branch instructions are discussed. Gradually, the students also learn the basics of assembly language programming and learn how to develop programs for various problems. Furthermore, advanced topics such as stack, macro, subroutine, and interrupt are presented and practised through examples and discussions.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 212/COEN 243"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 313,
    "Name": "Digital Systems Design II",
    "Credits": "3.5",
    "Description": "In this course, students are exposed to a comprehensive overview of VHDL language and the synthesis process for the design of digital systems. First, students learn the hardware implementation of basic VHDL language constructs, then they are exposed to the core of the RT-level design, including combinational circuits, \u0022regular\u0022 sequential circuits, finite state machines, and circuits designed using register transfer methodology. Students are introduced as well to concepts related to metastability, self-timed circuits, programmable logic devices, field programmable gate arrays and testing issues.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 212/COEN 231"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 314,
    "Name": "Digital Electronics I",
    "Credits": "3.5",
    "Description": "This is an introductory course in digital electronics. In the first part of the course, students learn the very basics of MOSFETs, including the physical structure, creation of channels and nonlinear characteristics, to understand why and how they are used as the basic devices in mainstream digital circuits. Then, DC analysis and transient analysis of basic logic units, in particular CMOS inverters and gates, are presented. Students learn different performance aspects, including delay/power/critical path analysis and estimation, and understand the specifications of digital circuits. Students are also exposed to the transistor-level design of basic CMOS functional blocks such as XOR gates, adders, mux, tri-state, buffers, latches, RSFFs and DFFs. Furthermore, the design principle and read/write operations of static and dynamic RAM memory cells are presented.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for COEN 315 or COEN 415 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 212",
      "ELEC 273"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 316,
    "Name": "Computer Architecture and Design",
    "Credits": "3.5",
    "Description": "This course introduces students to fundamentals of the organization of the design of modern computer systems. Students learn cost issues and performances evaluation of processors and are exposed to instruction set design principles and its impact on both software programming and hardware design. Pipelining is studied, along with a hazards issue and solutions such as forwarding units. Memory hierarchy is presented, with a focus on caches organizations such as direct mapped, fully associative and set associative. Virtual memories and multi-processors architectures are introduced.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 311/COEN 313"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 317,
    "Name": "Microprocessor‑Based Systems",
    "Credits": "3.5",
    "Description": "First, an introduction on a history of microprocessors and its advancement are presented. Then, students get familiar with the microprocessor architecture, its instructions, bus organization, data transfer and memory interfacing. Next, the focus of the course is placed on the fundamentals of interfacing. Students learn how to use General Purpose Input Outputs (GPIOs) to connect various peripheral devices to the microprocessor and write programs to control these devices. Examples of peripheral devices are Light Emitted Diodes (LEDs), switches, timer/counters, seven-segments, Liquid Crystal Displays (LCDs) and sensors. They also learn how to configure serial communication protocols. Moreover, students are exposed to advanced topics including interrupt system and Direct Memory Access (DMA).",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for COEN 417 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 311/COMP 228/SOEN 228",
      "COEN 313"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 320,
    "Name": "Introduction to Real‑Time Systems",
    "Credits": "3",
    "Description": "Fundamentals of real‑time systems: definitions, requirements, design issues and applica‑ tions. Real‑time operating systems (RTOS) feature: multi‑tasking, process management, scheduling, interprocess communication and synchronization, real‑time memory management, clocks and timers, interrupt and exception handling, message queues, asynchronous input/output. Concurrent programming languages: design issues and examples, POSIX threads and semaphores. Introduction to real‑time uniprocessor scheduling policies: static vs. dynamic, pre‑emptive vs. non‑pre‑emptive, specific techniques — rate‑monotonic algorithm, earliest‑deadline‑first, deadline monotonic, least‑laxity‑time‑first; clock‑driven scheduling. Design and specification techniques — Finite state machine based State‑chart, Dataflow diagram, Petri nets. Reliability and fault‑tolerance. Case studies of RTOS — QNX, VxWorks, and research prototypes.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 346/COMP 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 346,
    "Name": "Operating Systems",
    "Credits": "3.5",
    "Description": "The evolution, architecture, and use of modern operating systems (OS). Multi‑tasking, concurrency and synchronization, IPC, deadlock, resource allocation, scheduling, multi‑threaded programming, memory and storage managements, file systems, I/O techniques, buffering, protection and security, the client/server paradigm and communications. Introduction to real time operating systems. Students write substantial programs dealing with concurrency and synchronization in a multi‑tasking environment.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for COMP 346 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 311",
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 352,
    "Name": "Data Structures and Algorithms",
    "Credits": "3",
    "Description": "Mathematical introduction: mathematical induction, program analysis, and algorithm complexity. Fundamental data structures: lists, stacks, queues, and trees. Fundamental algorithms: hashing and sorting. Graph structures and algorithms. Overview of algorithm design techniques, including greedy algorithms, divide and conquer strategies, recursive and backtracking algorithms, and heuristics. Application of data structures and algorithms to engineering.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for COMP 352 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 231/COEN 244"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 366,
    "Name": "Communication Networks and Protocols",
    "Credits": "3.5",
    "Description": "The main objectives of the course are an introduction to computer networks, architectures, protocols, and their fundamentals. Topics covered in the course include communications protocols basics, flow control, error detection and error control techniques, network topologies including local area networks (LANs) and wide area networks (WANs), layered architecture standards (OSI and TCP/IP), standard protocols, and their fundamentals, application and socket programming.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for ELEC 366, ELEC 463 or COEN 445 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 390,
    "Name": "Computer Engineering Product Design Project",
    "Credits": "3",
    "Description": "The Product Design Project reinforces skills introduced in ENGR 290, which include teamwork, project management, engineering design for a complex problem, technical writing, and technical presentation in a team environment. It also introduces students to product development. Students are assigned to teams and each team develops, defines, designs and builds a system and/or device under broad constraints set by the Department. Students present their product definition and design, and demonstrate that their system/device works at the end of the term.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory Equivalent time, 6 hours per week"
    ],
    "Notes": [
      "All written documentation must follow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 311/COEN 352",
      "ENGR 290"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 413,
    "Name": "Hardware Functional Verification",
    "Credits": "3.5",
    "Description": "This course is about functional verification techniques and tools for hardware systems. It starts with the review of hardware design languages and the definition of hardware functional verification, then it introduces basic object-oriented programming notions, such as classes, methods, inheritance, threads, inter-process communications, and virtual methods. Students are later introduced to coverage metrics, functional coverage, and functional verification CAD tools. Students learn the use of SystemVerilog language to develop class-based verification environment based on the universal verification methodology (UVM). Students are exposed to practical verification case studies.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 12 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 313"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 414,
    "Name": "Digital Electronics II",
    "Credits": "3.5",
    "Description": "In this course, students learn to design digital functional blocks of different logic families, developed with CMOS IC technology. The focus is on the electronics aspect of digital circuit design. Students discover how logic functions are performed in pseudo-MOS, Pass Transistor Logic gates, and various dynamic gates, such as Domino gates and zipper logic gates. They also learn to analyze and to design pulse generators, including VCOs \u0026amp; ICOs, Schmitt triggers, memory circuits, and other specific circuit blocks. Low-power design techniques are also presented.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for COEN 315 or COEN 415 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 314"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 421,
    "Name": "Embedded Systems Design",
    "Credits": "4",
    "Description": "Embedded systems, foundations for cyber‑physical systems design. Embedded HW architectures, sensors, actuators, processors. IO and peripherals, memory architectures, interfacing memory and peripheral. Hardware‑software partitioning, software transformations, floating to fixed point conversion, loop transformations, code compaction, low‑power design and embedded system testing.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 30 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 317/COEN 320",
      "SOEN 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 422,
    "Name": "Foundations of Cyber‑Physical Systems",
    "Credits": "3",
    "Description": "Cyber-Physical Systems (CPS) consist of interacting networks of physical and computational elements. This course covers the fundamentals of modelling, specification, analysis and design of CPS. Models for computation and physical systems including discrete event dynamic models, finite-state machines, extended FSMs, statecharts, Petri nets and continuous variable models are studied. Scheduling and optimization of process networks and hybrid models are covered. Specification, simulation and performance analysis of CPS and the relationship of program execution with physical time constants are discussed.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 346",
      "ELEC 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 424,
    "Name": "Programming on the Cloud",
    "Credits": "3",
    "Description": "Autonomy of cloud computing, service and business models, data centres and virtualization. CAP theorem, REST API and data models. Map reduce and programming model of distributed data processing on computer clusters. Distributed file systems for computer clusters, development environments and tools on clouds. Cloud‑based data access and query. Cloud application design principles.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 432,
    "Name": "Applied Machine Learning and Evolutionary Algorithms",
    "Credits": "3",
    "Description": "The course covers a variety of machine learning algorithms with applications to real-world problems of classification and prediction, optimization and design. The first part of the course introduces fundamental concepts of machine learning and some well-established models, such as decision tree models, linear models, distance-based models and probabilistic models. This is followed by machine learning heuristics such as tabu search, simulated annealing and particle swarm optimization. The second part of the course focuses on evolutionary algorithms and, in particular, genetic algorithms, evolutionary strategies and genetic programming, followed by salient advanced concepts such as multi-objective optimization.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 352/COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 433,
    "Name": "Biological Computing and Synthetic Biology",
    "Credits": "3",
    "Description": "Introduction to the cell and the genome. Foundations of synthetic biology and ethics. Synthetic genomes and metabolic engineering. Model organisms, such as E. coli bacteria and synthetic cells, self-replicating cells man-made from cloned genes, a cellular membrane and the basic elements of RNA and protein synthesis. Designing computational devices for implementation in biological cells. Introduction to modelling and computer simulation of gene regulatory networks. Methods of building and testing gene regulatory networks within and without cells. Expanding functionality via inter-cellular signaling. Basic interfacing to electronic sensors and actuators. Landmark and interesting applications of synthetic biology in computer engineering and other disciplines.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BIOL 475 or for this topic under a BIOL 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": null
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 434,
    "Name": "Microfluidic Devices for Synthetic Biology",
    "Credits": "3",
    "Description": "This course introduces students to microfluidic components (pumps, valves, automation) programming microfluidics, paradigms, and applications for chemical and biological analysis. Introduction to synthetic biology; biological parts and their properties, network structure and pathway engineering, synthetic networks, manipulating DNA and measuring responses, basic behaviour of genetic circuits, building complex genetic networks; integration of microfluidics and synthetic biology; economic implications.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BIOL 476 or for this topic under a BIOL 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": null
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 446,
    "Name": "Internet of Things",
    "Credits": "3",
    "Description": "This course covers the paradigm change from the Internet and devices to the Internet of Things (IoT). It also covers the IoT business models and applications, including health monitoring and smart cities, IoT characteristics, constraints and requirements. IoT protocol stack is also covered and its contrasts with the TCP/IP protocol stack are discussed. Other covered topics include physical, link and networking layer protocols. Moreover, the course covers the message queueing telemetry transport (MQTT), constrained application (CoAP), application layer protocols and efficient XML interchange (EXI). The course provides an introduction to security threats and privacy in IoT systems, IoT analytics, platforms and tools.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 366/ELEC 366"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 447,
    "Name": "Software‑Defined Networking",
    "Credits": "3",
    "Description": "This course equips students with an understanding of the principles and techniques underpinning the design of software‑defined networks.Topics include control and data planes, centralized vs. distributed control; network operating systems, network function virtualization; programmable data planes, network processors, programmable switch pipelines; high-level data-plane programming with P4 and data-plane development kit. This course includes a software‑defined network emulation project.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 317",
      "COEN 366/ELEC 366"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 448,
    "Name": "Software Testing and Validation",
    "Credits": "3.5",
    "Description": "This course starts with an overview of the three phases and deliverables of a project, and then discusses validation vs.verification, reviews and walk‑through. Topics also include acceptance testing, integration testing, module testing. The course covers writing stubs, performance testing, the role of formal methods, code inspection, defect tracking and causality analysis. It concludes with software metrics and quality management.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for COEN 345 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "SOEN 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 451,
    "Name": "VLSI Circuit Design",
    "Credits": "4",
    "Description": "Analysis and design of electronic circuits using Very Large Scale Integration (VLSI) technologies. Physical design of MOS digital circuits. CMOS circuit schematic and layout. CMOS processing technology, design rules and CAD issues. Physical layers and parasitic elements of CMOS circuits. Characterization and performance evaluation. Constraints on speed, power dissipation and silicon space consumption. Design and implementation of CMOS logic structures, interconnections and I/O structures. Circuit design project using a specified CMOS technology.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 30 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 212",
      "ELEC 311"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 490,
    "Name": "Capstone Computer Engineering Design Project",
    "Credits": "6",
    "Description": "Students are assigned to groups, and work together under faculty supervision to solve a complex interdisciplinary design problem— typically involving communications, control systems, electromagnetics, power electronics, software design, and/or hardware design. The project fosters teamwork between group members and allows students to develop their project management, technical writing, and technical presentation skills.",
    "Components": [
      "Tutorial 1 hour per week, two terms",
      "Laboratory Equivalent time, 9 hours per week, two terms"
    ],
    "Notes": [
      "All written documentation must follow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project."
    ],
    "Duration": 2,
    "Prerequisites": [
      "ENGR 301/ENGR 371",
      "COEN 390",
      "SOEN 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COEN",
    "Number": 498,
    "Name": "Topics in Computer Engineering",
    "Credits": "3",
    "Description": "The course, when offered, will include topics which complement elective courses in computer engineering and computer science",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 242,
    "Name": "Continuous‑Time Signals and Systems",
    "Credits": "3",
    "Description": "This course covers continuous-time signals and systems theory including properties of continuous-time systems, linear time-invariant (LTI) systems, impulse response and convolution and systems based on linear constant‑coefficient differential equations. The following transforms are introduced: Fourier series representation of periodic signals, the Fourier transform representation of signals and systems, the inverse Fourier transform, bilateral Laplace transform, unilateral Laplace transform and inverse Laplace transform. Other topics include zero-state and zero-input responses of linear constant‑coefficient differential equation models, transfer function and block diagram representation of LTI systems, and time and frequency domain characteristics of ideal and non‑ideal filters. Computer simulation using MATLAB is also introduced.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for ELEC 264 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 273",
      "ENGR 213"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 251,
    "Name": "Fundamentals of Applied Electromagnetics",
    "Credits": "3",
    "Description": "Electric charge, Coulomb’s law, electrostatic forces, electric field, Gauss’ law, electric potential, stored energy. Dielectrics, properties of materials in electric fields. Electric current, conduction in a vacuum and in material media, displacement current, magnetic field of a current, force on a current‑carrying wire, magnetic induction, electromotive force, energy stored in a magnetic field. Magnetism in material media, magnetic circuits.Time‑varying fields. Capacitance, resistance, inductance, elements of electric circuits.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 273/ENGR 273",
      "ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 273,
    "Name": "Basic Circuit Analysis",
    "Credits": "3.5",
    "Description": "This course presents a comprehensive, overview of electrical circuit analysis techniques. First, students learn Ohm\u0027s Law, KVL, KCL, mesh analysis and nodal analysis. Then they learn circuit theorems including superposition, Thevenin and Norton\u0027s Theorems. Ideal operational amplifier circuits are studied. Students learn how to find the transient response of circuits including resistors, inductors, and capacitors. Students learn steady-state AC analysis using phasors and impedance, AC circuit theorems, and the calculation of power in AC circuits.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "PHYS 205",
      "ENGR 213"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 275,
    "Name": "Principles of Electrical Engineering",
    "Credits": "3.5",
    "Description": "Fundamentals of electric circuits: Kirchoff’s laws, voltage and current sources, Ohm’s law, series and parallel circuits. Nodal and mesh analysis of DC circuits. Superposition theorem, Thevenin and Norton Equivalents. Use of operational amplifiers. Transient analysis of simple RC, RL and RLC circuits. Steady state analysis: Phasors and impedances, power and power factor. Single and three phase circuits. Magnetic circuits and transformers. Power generation and distribution.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "PHYS 205",
      "ENGR 213"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 311,
    "Name": "Electronics I",
    "Credits": "3.5",
    "Description": "The course first presents diodes: students get familiar with terminal characteristics of junction diodes and analysis of diode circuits. The small signal model and its application are presented, as well as operation in the reverse-breakdown region (Zener diodes), rectifiers, limiting and clamping circuits. Students learn principles of signal amplification, including linearity, loading effects and cascaded amplifiers. MOSFETs structure, physical operation and current-voltage characteristics are then discussed. Students also learn MOSFET applications, DC analysis and biasing considerations (small signal analysis, models and parameters). The three basic configurations (common gate, common source and common drain) and amplification are explained. An overview of BJT circuits is also presented and covers the structure and physical operation of BJTs, DC analysis, biasing considerations and basic configurations for amplification. The course involves PSPICE laboratory pre-labs and extensive simulation exercises.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 273"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 312,
    "Name": "Electronics II",
    "Credits": "3.5",
    "Description": "Differential and multi‑stage amplifiers: differential pair; differential gain; common‑mode gain and common‑mode rejection ratio (CMRR) current mirrors. High frequency models: s‑domain analysis, transfer functions; common gate, common source, common drain configurations; common base, common emitter, common collector configurations; wide‑band amplifiers. Feedback: general feedback structure; properties of negative feedback; the four basic feedback configurations; loop gain and stability problems. Power amplifiers: classification and output stages; class A, B, C, and AB amplifiers; biasing the class AB amplifier. Introduction to filters, tuned amplifiers, oscillators and mixers. PSPICE.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 311",
      "ELEC 242/ELEC 364"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 321,
    "Name": "Introduction to Semiconductor Materials and Devices",
    "Credits": "3.5",
    "Description": "Fundamentals underlying optical and electronic devices. The structure and growth of crystals. The energy band model for elemental and compound semiconductors. Electronic and optical properties of semiconductors. Electroluminescence and photoluminescence. The semiconductor in equilibrium. Carrier transport and non‑equilibrium phenomena. Introductions to junctions and devices. The laboratory demonstrates the basic electrical and optical properties of semiconductor materials.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "CHEM 205",
      "ENGR 213"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 331,
    "Name": "Fundamentals of Electrical Power Engineering",
    "Credits": "3.5",
    "Description": "Review of fundamentals of AC circuit analysis. Overview of power systems. Three‑phase circuits: balanced three‑phase circuits with star and delta connected loads, power measurements. Magnetic circuits. Transformers. Power conversion techniques: single phase AC/DC rectifiers, DC/DC choppers and DC/AC converters. DC machines: Operating principle, separately excited DC motor, torque speed characteristics and control methods using rectifiers and choppers. Induction machines: Theory of three‑phase induction machines, equivalent circuit parameters, efficiency, torque speed characteristics and control methods using inverters. Overview of power distribution systems. Safety codes.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 251/ELEC 273"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 342,
    "Name": "Discrete‑Time Signals and Systems",
    "Credits": "3.5",
    "Description": "Basic material includes discrete vs. continuous-time signals, discrete-time signals, elementary signals and signal operations, discrete-time systems, properties of discrete-time systems and interconnections of systems. Time‑domain analysis of discrete‑time systems is covered including finite difference equation representation of systems,linear time-invariant (LTI) systems, unit impulse response and convolution, sliding tape method for convolution, periodic convolution, properties of convolution, and properties of LTI systems. The next area is Fourier domain analysis including Discrete-Time Fourier Series (DTFS), Discrete-Time Fourier Transform (DTFT), properties of DTFS and DTFT, frequency response of LTI systems, and continuous and discrete-time Fourier transforms. Conversion of continuous-time to discrete-time signals is covered including ideal impulse train sampling, the sampling theorem, effect of sampling in the frequency and time domains graphically and algebraically, anti‑aliasing pre‑filter, reconstruction of band limited signal from its samples, discrete‑time processing of continuous‑time signals, quantization, uniform quantization, quantization noise, granular vs. overload noise, and design of uniform quantizers. The Discrete Fourier Transform (DFT) is developed along with the relationship between the DFT and the DTFT. Also covered is the relationship between the DFT and the Fast Fourier Transform (FFT). The z-transform (ZT) is covered with topics including properties, poles and zeros of rational ZTs, inverse and unilateral z-transforms (UZT), Region of Convergence (ROC), and relationship between ZT and DTFT. Filtering topics include LTI systems as frequency‑selective filters, ideal filters, Finite Impulse Response (FIR) vs. Infinite Impulse Response (IIR) filters, linear phase FIR filters, filter specification, and designing filters with MATLAB. The course closes with FIR filter design with windowing.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for ELEC 364 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 242/ELEC 264"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 351,
    "Name": "Electromagnetic Waves and Guiding Structures",
    "Credits": "3.5",
    "Description": "This course presents the partial differential equations governing transmission lines and their solution in the time domain and in the frequency domain. The input impedance is found and transmission line circuits are solved. The Smith Chart is derived and used to design impedance matching. Maxwell’s Equations are used to find the wave equation, which is solved to discover uniform plane waves. Boundary conditions are enforced to find Snell’s Laws and the Fresnel reflection coefficients for a dielectric half space. The fields in rectangular waveguide are found as the solution to a boundary value problem, and the behaviour of waveguides is studied. Antenna are studied including directional radiation, antenna arrays, directivity and gain, effective area, and the Friis Transmission Equation.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 242/ELEC 251"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 365,
    "Name": "Complex Variables and Partial Differential Equations",
    "Credits": "3",
    "Description": "Review of complex arithmetic. Analytic functions. Taylor and Laurent series. Residue theory. Fourier series. Partial differential equations. Applications to Laplace, heat, and wave equations. Bessel and Legendre functions.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for ELEC 261 or 362 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 366,
    "Name": "Telecommunication Networks",
    "Credits": "3.5",
    "Description": "The course introduces communication network functions/services and the circuit and packet-switching approaches for network design. It covers transmission systems, multiplexing, switches, signalling and traffic control in circuit‑switched networks including cellular networks. It introduces the layered network architecture for packet-switching: peer-to-peer ARQ protocols and data-link controls;TCP/IP architecture: Internet and transport protocols. It covers multiple access communications: Aloha, CSMA, reservation schemes, polling, token passing rings, wireless LANs and LAN bridges. It includes application and socket programming.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for COEN 366 or COEN 445 or ELEC 463 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 352",
      "ELEC 342/ELEC 364",
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 367,
    "Name": "Introduction to Digital Communications",
    "Credits": "3.5",
    "Description": "The following topics are covered: analog communications and frequency multiplexing; pulse‑code‑modulation time multiplexing; additive white Gaussian noise; matched filter and correlator receiver; maximum likelihood receiver and error probability; intersymbol interference, pulse shaping filter; Signal Space Analysis; Union Bound on the probability of error; Pass‑band communication Systems; coherent and non‑coherent communication systems. Introduction to synchronization.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for ELEC 462 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 342/ELEC 364",
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 372,
    "Name": "Fundamentals of Control Systems",
    "Credits": "3.5",
    "Description": "Mathematical models of control systems. Characteristics, performance, and stability of linear feedback control systems. Root‑locus methods. Frequency response methods. Stability in the frequency domain. Design and compensation of feedback control systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for AERO 371 or ENGR 372 or MECH 371 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 242/ELEC 364"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 390,
    "Name": "Electrical Engineering Product Design Project",
    "Credits": "3",
    "Description": "The Product Design Project reinforces skills introduced in ENGR 290, which include teamwork, project management, engineering design for a complex problem, technical writing, and technical presentation in a team environment. It also introduces students to product development. Students are assigned to teams and each team develops, defines, designs and builds a system and/or device under broad constraints set by the Department. Students present their product definition and design, and demonstrate that their system/device works at the end of the term.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory Equivalent time, 6 hours per week"
    ],
    "Notes": [
      "All written documentation must follow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COEN 352",
      "ELEC 311",
      "ENGR 290"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 413,
    "Name": "Mixed‑Signal VLSI for Communication Systems",
    "Credits": "4",
    "Description": "Overview of wireline communication links, mechanisms of signal degradation, modulation formats, TX/RX synchronization options, IC technology limitations, transmitter front‑end circuits, receiver front‑end circuits, decision circuits, clock and data recovery systems, phase‑locked loops, jitter, continuous‑time and discrete‑time equalizers, system metrics.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 30 hours total"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ELEC 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 312/ELEC 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 421,
    "Name": "Solid State Devices",
    "Credits": "3.5",
    "Description": "Junction theory (PN junctions, Schottky and ohmic contacts, hetero‑junctions). Structures and characteristics of diodes, solar cells, bipolar transistors, and fundamentals of MOSFETs. Planar silicon junctions and transistors will be designed, fabricated and evaluated in the laboratory, including resistivity measurements, semiconductor cleaning, oxidation, diffusion, photolithography, etching, metallization, and comparison of design with experimental results.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 321"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 422,
    "Name": "Design of Integrated Circuit Components",
    "Credits": "3.5",
    "Description": "Structures, characteristics and design of MOS capacitors and MOSFETs. FinFETs, SOI FETs, velocity‑modulation transistors, and HFETs. Role of strain in operation of modern FETs. Planar MOS devices, including capacitors and MOSFETs will be designed, fabricated, and evaluated in the laboratory.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 421"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 423,
    "Name": "Introduction to Analog VLSI",
    "Credits": "4",
    "Description": "CMOS transistor layout considerations, design rules, circuit extraction. MOSFET modelling, I‑V equations, AC equivalent circuits for high‑frequency operation, computer‑based simulation. Analysis and design of small‑scale integrated circuit building blocks including MOS switch, active resistor, current source, current mirror, voltage amplifiers, voltage‑reference circuits, multipliers. Analysis and design of medium‑scale integrated circuit building blocks including op‑amps, fully‑differential op‑amp and common mode feedback circuits, transconductance amplifiers, transimpedance amplifiers, comparators. Noise analysis. Mismatch analysis and modelling, offset removal techniques. Analog VLSI system examples.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 30 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 312"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 424,
    "Name": "VLSI Process Technology",
    "Credits": "3.5",
    "Description": "Introduction to basic VLSI technologies; crystal growth, thermal oxidation, diffusion, ion implantation, chemical vapour deposition, wet and dry etching, and lithography. Layout, yield, and VLSI process integration. The lab demonstrates a semiconductor device fabrication process.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 311/ELEC 321"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 425,
    "Name": "Optical Devices for High‑Speed Communications",
    "Credits": "3.5",
    "Description": "Optical properties of semiconductors. Fundamental principles for understanding and applying optical fibre technology. Fundamental behaviour of the individual optical components and their interactions with other devices. Lasers, LEDs, optical fibres, light detectors, optical switches. Concepts of WDM and DWDM. Components required for WDM and DWDM. A comprehensive treatment of the underlying physics: noise and distortion in optical communications, light polarization, modulation and attenuation.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 321/ELEC 351"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 430,
    "Name": "Electrical Power Equipment",
    "Credits": "3.5",
    "Description": "Components of a transmission system. Transmission line; modelling and parameters. Transformers: equivalent circuits, losses, connections and protection. Breakers: operation and design. Compensation equipment: capacitors, inductors, series and shunt connections. Insulation coordination.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 431,
    "Name": "Electrical Power Systems",
    "Credits": "3.5",
    "Description": "Inductance, capacitance, resistance of polyphase transmission lines; current and voltage relations of transmission lines; load flow studies; symmetrical and unsymmetrical faults; power system stability.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 432,
    "Name": "Control of Electrical Power Conversion Systems",
    "Credits": "3.5",
    "Description": "Basic considerations and control requirements. Control system principles and structures. Controller characteristics and operation. Static power conversion systems. Electromechanical systems and electrical machine modelling. Control system design. Applications to electric motor drives and typical power conversion systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331/ELEC 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 433,
    "Name": "Power Electronics",
    "Credits": "3.5",
    "Description": "Review of basic electrical concepts. Power electronic systems. Power semiconductor switches. AC controllers. Line frequency AC‑DC converters: diodes and thyristor circuits. DC‑DC converters. DC‑AC converters. Utilityapplications: STATCOM and power electronic interfaces. Industrial and utility applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 311/ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 434,
    "Name": "Behaviour of Power Systems",
    "Credits": "3.5",
    "Description": "Introduction: classification of phenomena, structure of power systems. Review of component models: lines, transformers, electrical machines and load. Excitation systems of machines. Steady‑state operation. Transient stability, voltage stability and small signal stability. Compensation methods: stabilizer, series and shunt compensators. Sub‑synchronous resonances. Transient electromagnetic phenomena. Methods and tools for numerical simulation.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 435,
    "Name": "Electromechanical Energy Conversion Systems",
    "Credits": "3.5",
    "Description": "This course covers the following topics: lumped parameter concepts of electromechanics; energy, co-energy in the derivation of torques and forces; examples of electric machines: dc, synchronous and induction types; steady-state, transient and stability analysis; power electronic controllers.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 436,
    "Name": "Protection of Power Systems",
    "Credits": "3.5",
    "Description": "General aspects of protection systems. Measurement transformers. Grounding. Overcurrent and ground fault protection. Protection of transformers, shunt capacitors and buses. Protection of transmission lines. Telecommunication for protection and automation systems. Protection of inverters. Protection of distribution networks.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 437,
    "Name": "Renewable Energy Systems",
    "Credits": "3",
    "Description": "Electrical basics and models of solar energy (photo‑voltaics), electrical power from wind energy, electrical power from water, including wave energy, tidal energy, micro‑hydro. Case studies, for example the application of solar PV to street lighting. Electrical engineering design implications. Design assignments.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ELEC 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 438,
    "Name": "Industrial Electrical Systems",
    "Credits": "3.5",
    "Description": "Structures of industrial power systems. Voltage levels. Electric installations, codes and standards. Short‑circuits, protection and coordination. Grounding. Power quality. Power factor, tariffs and energy management.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 439,
    "Name": "Hybrid Electric Vehicle Power System Design and Control",
    "Credits": "3",
    "Description": "Introduction to Electric Vehicles (EV), Hybrid Electric Vehicles (HEV). Vehicle design fundamentals. Traction motors for EV/HEV propulsion. On‑board energy sources and storage devices: high‑voltage traction batteries, fuel cells, ultra‑capacitors, flywheels. Power electronic converters and control. Various EV/HEV/Fuel Cell Vehicle topologies and modelling. Energy management strategies. Practical design considerations. Engineering impact of electric, hybrid electric, and fuel cell vehicles.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 440,
    "Name": "Controlled Electric Drives",
    "Credits": "3.5",
    "Description": "Elements of a drive system, characteristics of common mechanical systems, drive characteristics, operation in one, two, or four quadrants. Fully controlled rectifier drives, braking of DC motors, control of DC motors using DC/DC converters. Control of polyphase induction motors, voltage‑source and current‑source inverter drives, frequency‑controlled induction motor drives, introduction to vector control of induction motor drives, field oriented control, sensor‑less operation. Control of synchronous motors, permanent magnet motors. Switched reluctance motor drives, stepper motors. Brushless DC motor drives, low‑power electronic motor drives.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ELEC 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331/ELEC 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 441,
    "Name": "Modern Analog Filter Design",
    "Credits": "3.5",
    "Description": "Review of network analysis. Magnitude and frequency scaling. Magnitude and phase approximation in synthesis of filter functions. Second‑order active RC filters. Synthesis of all‑pole LC ladder filters. Second‑order switched‑capacitor filters. Realization of high‑order active filters. Current mode filters. Switched‑current filters. Integrated circuit filters.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 342/ELEC 364"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 442,
    "Name": "Advanced Signal Processing",
    "Credits": "3",
    "Description": "This course focuses on fundamental principles, methods and applications of statistical and adaptive signal processing. It begins with the introduction of random signal processing basics, including random variables and sequences, linear systems with stationary inputs, linear signal models, power spectral density estimation. It then covers optimum linear filtering and prediction, namely, Wiener filter, constrained minimum mean square error (MMSE) estimation, array/space-time processing and beamforming, forward and backward linear prediction. The course also covers adaptive filtering methods including least mean square filters, least-square filter, recursive least square filter, Kalman filter. Finally, the course ends with machine learning principles for signal processing including Bayesian learning, support vector machine, and neural network basics.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": null
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 443,
    "Name": "Electric Power Distribution Networks",
    "Credits": "3",
    "Description": "This course covers the following topics: fundamentals of distribution systems; overhead lines and cables, physical characteristics; neutral network; distribution protection; protection coordination, equipment failures; service continuity, norms, fault duration and damage; network architectures; distributed generation, network integration; power quality, connection requirements, harmonics, voltage sag, flicker; distribution network analysis software, unbalanced power flow, faulted operation.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "This course is usually offered in the French language."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 331"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 444,
    "Name": "Medical Image Processing",
    "Credits": "3",
    "Description": "Principles and techniques used in the processing and analysis of medical images. Image quality metrics, denoising medical images, quantification, rigid and deformable registration. Similarity metrics such as mutual information (MI). Images from the most common medical imaging modalities (X‑ray, CT, MRI and ultrasound) will be used.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 342/ELEC 364"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 445,
    "Name": "Biological Signal Processing",
    "Credits": "3",
    "Description": "This course covers signal processing through discussion of current bioengineering activities which rely on signal processing and include assessment of neural function with simultaneous collection of electroencephalogram (EEG) and functional MRI data; the non-invasive assessment of cardiac autonomic regulation using electrocardiography; assessment of neural function using near-infrared spectroscopy (NIRS); assessment of muscle activity using electromyography (EMG). Topics include modern spectral analysis, time-frequency analysis (short-time Fourier transforms and wavelets); signal modelling; multivariate analyses and adaptive filtering.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ELEC 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 342"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 446,
    "Name": "Electrical Power Generation",
    "Credits": "3",
    "Description": "This course covers the following topics: primary energy resources, conventional and renewable; electric power generation principles; rotating and static power conversion, frequency and voltage control; synchronous generators, design and operation; generation control; static power converter interfaces, principles and operation; wind energy conversion principles, generator control and wind farm control; energy storage control and integration; generation protection; distributed generation interconnection requirements.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 9 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 431"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 447,
    "Name": "Video Processing and Recognition",
    "Credits": "3",
    "Description": "This course focuses on theoretical foundations of video processing: human vision, colour models, visual frequencies, convolution, frequency analysis, sampling, video capture and display, and video models. Motion characterizes a video and the course covers object transformations, motion models, motion and homography estimation. A video consists of images and basics of image processing are presented: filtering, multi-scale analysis, histogram and feature extraction. The course covers video applications: video enhancement including quality assessment, frame prediction, denoising; video compression including statistics of signal source, transform coding, predictive coding; video recognition including object segmentation, object tracking, 3D shapes from 2D images. The course introduces deep-learned video processing with a case study, machine-learning basics (regression, classification), deep neural networks and convolutional neural networks.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": null
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 453,
    "Name": "Microwave Engineering",
    "Credits": "3.5",
    "Description": "Properties of waveguides, striplines, and microstrips. Scattering parameters. Butterworth and Chebyshev impedance transformers. Microwave couplers, cavities, and Fabry‑Perot resonators. Periodic structures. Microwave filter design. Faraday rotation and non‑reciprocal devices.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 351"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 455,
    "Name": "Acoustics",
    "Credits": "3",
    "Description": "Sound generation and propagation in elastic media; conversion between acoustical, electrical, and mechanical energy. Lumped‑parameter approximations, sound in rooms, underwater acoustics, microphones; loudspeakers and audio communications problems; noise and vibration control problems.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 351"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 456,
    "Name": "Antennas",
    "Credits": "3.5",
    "Description": "Antenna fundamentals and definitions. Radiation integrals. Dipoles and loops. Arrays. Antenna self and mutual impedance. Matching techniques. Travelling wave antennas. Broadband antennas. Equivalence principle. Aperture antennas. Antenna measurement techniques.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 351"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 457,
    "Name": "Design of Wireless RF Systems",
    "Credits": "3",
    "Description": "Introduction to wireless systems. Noise and distortion in microwave systems. Antennas and propagation. Amplifiers. Mixers. Transistor oscillators and frequency synthesizers. Modulation techniques. Receiver design. Use of RF CAD tools.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 453"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 458,
    "Name": "Techniques in Electromagnetic Compatibility",
    "Credits": "3",
    "Description": "Introduction to EMC procedures, control plans, and specifications. Radiated and conducted susceptibility and emission testing. Introduction to EMC antennas, antenna concepts, electric and magnetic dipoles, biconical dipoles, conical log spiral antennas, setting up fields for susceptibility testing, measuring radiation from equipment. Coupled transmission lines, pulse propagation, closely spaced parallel transmission lines, capacitive coupling, inductive coupling, shielding against magnetic fields. Shielding and enclosures, electric and magnetic field screening mechanisms, shielding effectiveness, grounding considerations. EMC test facilities, screened rooms, TEM cells, signals and spectra, intermodulation, cross‑modulation, the spectrum analyzer. Noise and pseudo‑random noise, noise performance of measurement/receiving systems, noise equivalent bandwidth, noise figure, antenna noise temperature and S/N ratio.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 351"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 464,
    "Name": "Wireless Communications",
    "Credits": "3",
    "Description": "Introduction to error control coding: linear block codes, syndrome‑based decoding, coding vs. modulation, convolutional codes, Viterbi decoder. Communications link analysis. Introduction to cellular systems: frequency reuse, trunking and grade of services, sectoring and cell splitting, coverage and capacity. Modulation techniques for mobile communications. Mobile radio channels. Spread‑spectrum techniques. Multiplexing and multiple access techniques. Wireless standards from first generation to fourth generation; OFDM: an architecture for the fourth generation.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 367"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 465,
    "Name": "Networks Security and Management",
    "Credits": "3.5",
    "Description": "This course covers two important areas of communication networks: network security and network management. In network security, topics include basic cryptography, authentication, message integrity, firewalls, security protocols, virtual private networks (VPNs), and security in wireless LANs. In network management, topics include network management architectures, ASN.1, Management Information Bases (MIBs), SNMP and its evolution.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 366/COEN 445/ELEC 366/ELEC 463"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 466,
    "Name": "Introduction to Optical Communication Systems",
    "Credits": "3.5",
    "Description": "Overview of optical fibres and optical fibre communications. Signal propagation in optical fibres: attenuation, chromatic dispersion, mode coupling, and nonlinearities. Optical transmitters’ characteristics and requirements for optical networks. Power launching and coupling: optical transmitter‑to‑fibre coupling, fibre‑to‑fibre joints, and optical fibre connectors. Optical receivers: basic structures, noise analysis, characteristics and requirements for optical networks. Digital/analog transmissions: link power budget, rise‑time budget, line coding, error correction, and noise effects on transmissions. WDM concepts: operation principle of WDM. Optical amplifiers: characteristics and requirements for optical networks, amplifier noise, system applications, and wavelength conversion. Optical networks: basic topologies, SONET/SDH, broadcast‑and‑select WDM networks, wavelength‑routed networks. Optical measurements: test equipments, attenuation/dispersion measurements, OTDR, eye pattern and OSA.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 351/ELEC 367"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 470,
    "Name": "Broadcast Signal Transmission",
    "Credits": "3",
    "Description": "Topics include signal definition, human eye limitations, pixel representation schemes, interfaces serial digital interface (SDI), image formats (1080i, 720i, 4k, 8k), compression schemes: MPEG‑2, MPEG‑4, moving JPEG. Modulation techniques: QPSK, QAM, VSB. Advanced terrestrial transmission standards such as DVB‑T2, ATSC‑3. Satellite broadcasting standards such as DVB/S2. Path calculation: antennas, up and down conversion, solid state and travelling wave tube amplifiers. Transmission lines, waveguide and coaxial cable.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ELEC 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 363/ELEC 367"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 472,
    "Name": "Advanced Telecommunication Networks",
    "Credits": "3.5",
    "Description": "This course covers Internet that has moved beyond the three “classical” services of email, file transfer and remote log‑in to providing real‑time multimedia communication. The course provides the basic building blocks for the students to understand the current capabilities and potential of high-speed Internet to support emerging Internet services. Review of Internet architecture is followed by quality of service (QoS) requirements and protocols such as differentiated services, integrated services, Resource reservation protocol (RSVP), and Multi protocol label switching (MPLS) to support QoS. Topics also include protocols and standards for voice over IP; H.323, Session Initiation Protocol (SIP) and Media Gateway Control Protocol (MGCP); and their interworking.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COEN 366/COEN 445/ELEC 366/ELEC 463"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 473,
    "Name": "Autonomy for Mobile Robots",
    "Credits": "3",
    "Description": "The course discusses application of autonomous wheeled robots such as autonomous cars, indoor robots, and (off‑road) unmanned ground vehicles. Topics include robot motion models, robot odometry, robot sensor models (beam models of range finders and feature‑based measurement models) and occupancy grid mapping. The course also covers state estimation for robot localization and introduction to simultaneous localization and mapping (SLAM). Assignments include algorithm implementation on a robot.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for this topic under an ELEC 498 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ELEC 372",
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 481,
    "Name": "Linear Systems",
    "Credits": "3.5",
    "Description": "Review of matrix algebra. State‑space description of dynamic systems: linearity, causality, time‑invariance, linearization. Solution of state‑space equations. Transfer function representation. Discrete‑time models. Controllability and observability. Canonical forms and minimal‑order realizations. Stability. Stabilizability and pole placement. Linear quadratic optimal control. Observer design.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for ENGR 471 may not take this course forcredit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "AERO 371/ELEC 372/MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 482,
    "Name": "System Optimization",
    "Credits": "3.5",
    "Description": "Linear least squares. Properties of quadratic functions with applications to steepest descent method, Newton’s method and Quasi‑Newton methods for nonlinear optimization. One‑dimensional optimization. Introduction to constrained optimization, including the elements of Kuhn‑Tucker conditions for optimality. Least pth and mini‑max optimization. Application of optimization techniques to engineering problems.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": [
      "Students who have received credit for ENGR 472 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 391/EMAT 391"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 483,
    "Name": "Real‑Time Computer Control Systems",
    "Credits": "3.5",
    "Description": "Introduction to real‑time computer control systems; a review of discrete‑time signals and systems, difference equations, z‑transform; sampled‑data systems, sample and hold, discrete models; discrete equivalents of continuous‑time systems; stability analysis; design specifications; design using root locus and frequency response methods; implementation issues including bumpless transfer, integral windup, sample rate selection, pre‑filtering, quantization effects and computational delay; scheduling theory and priority assignment to control processes, timing of control loops, effects of missed deadlines; principles and characteristics of sensors and devices, embedded processors, processor/device interface.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 15 hours total"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "AERO 371/ELEC 372",
      "ELEC 342/ELEC 364"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 490,
    "Name": "Capstone Electrical Engineering Design Project",
    "Credits": "6",
    "Description": "Students are assigned to groups, and work together under faculty supervision to solve a complex interdisciplinary design problem — typically involving communications, control systems, electromagnetics, power electronics, software design, and/or hardware design. The project fosters teamwork between group members and allows students to develop their project management, technical writing, and technical presentation skills.",
    "Components": [
      "Tutorial 1 hour per week, two terms",
      "Laboratory Equivalent time, 9 hours per week, two terms"
    ],
    "Notes": [
      "All written documentation must follow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project."
    ],
    "Duration": 2,
    "Prerequisites": [
      "ENGR 301/ENGR 371",
      "COEN 311",
      "ELEC 342",
      "ELEC 390"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "ELEC",
    "Number": 498,
    "Name": "Topics in Electrical Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Electrical and Computer Engineering Department. The course content may vary from offering to offering and will be chosen to complement elective courses available in a given year.",
    "Components": null,
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "IADI",
    "Number": 301,
    "Name": "Undergraduate Aerospace Industry Project I",
    "Credits": "3",
    "Description": "The activities associated with this course include an industry-based project in the aerospace field, participation in regular meetings with the industry supervisor, attendance at training sessions (as applicable), industry training and tours. A final report of the industry project must be submitted to the director of education of CIADI. A grade of pass or fail will be awarded based on the evaluation of the final report as well as an assessment provided by the industry project supervisor.",
    "Components": [
      "Lecture"
    ],
    "Notes": [
      "The Undergraduate Aerospace Industry Project courses IADI 301 and IADI 401 are three‑credit extension courses. They are above and beyond the credit requirements of the students program and are not transferable, nor are they included in the full- or part‑time assessment status."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "IADI",
    "Number": 401,
    "Name": "Undergraduate Aerospace Industry Project II",
    "Credits": "3",
    "Description": "The activities associated with this course include an industry-based project in the aerospace field, participation in regular meetings with the industry supervisor, attendance at training sessions (as applicable), industry training and tours. A final report of the industry project must be submitted to the director of education of CIADI. A grade of pass or fail will be awarded based on the evaluation of the final report as well as an assessment provided by the industry project supervisor.",
    "Components": [
      "Lecture"
    ],
    "Notes": [
      "The Undergraduate Aerospace Industry Project courses CIADI 301 and 401 are three‑credit extension courses. They are above and beyond the credit requirements of the students program and are not transferable, nor are they included in the full- or part‑time assessment status."
    ],
    "Duration": 1,
    "Prerequisites": [
      "IADI 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "IADI",
    "Number": 420,
    "Name": "Professional Development and Experiential Learning in Aerospace",
    "Credits": "0",
    "Description": "Students enrolled in a minimum of six hours of professional development workshops, lectures and/or experiential learning activities in the aerospace sector, provided by CIADI, may request to have this course appear on their official university transcript. Requests can be made by contacting the CIADI education director.",
    "Components": null,
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 211,
    "Name": "Introduction to Production and Manufacturing Systems",
    "Credits": "3",
    "Description": "History of industrial engineering. Role of industrial engineers. Types of manufacturing and production systems. Material flow systems. Job design and work measurement. Introduction to solution methodologies for problems which relate to the design and operation of integrated production systems of humans, machines, information, and materials.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 311,
    "Name": "Simulation of Industrial Systems",
    "Credits": "3.5",
    "Description": "Modelling techniques in simulation; application of discrete simulation techniques to model industrial systems; random number generation and testing; design of simulation experiments using different simulation languages; output data analysis.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 320,
    "Name": "Production Engineering",
    "Credits": "3",
    "Description": "The systems approach to production. Interrelationships among the component blocks of the system: forecasting, aggregate planning, production, material and capacity planning, operations scheduling. An overview of integrated production planning and control including MRP II, Just in Time manufacturing (JIT).",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 323"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 321,
    "Name": "Lean Manufacturing",
    "Credits": "3",
    "Description": "Lean fundamentals; lean manufacturing; lean engineering; lean principles, tools and techniques, practices, and implementation; five S’s, process analysis/spaghetti charts, value engineering; value stream mapping; standardized work/ standard times; set‑up reduction/line balancing; unit manufacturing; cell layout/cellular manufacturing; total productive maintenance; anban; lean supply chain management; transition‑to‑lean roadmap; people/organizational issues in the lean enterprise; Six Sigma;TOM; agile manufacturing.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for INDU 420 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "INDU 320"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 323,
    "Name": "Operations Research I",
    "Credits": "3.5",
    "Description": "An introduction to deterministic mathematical models with emphasis on linear programming. Applications to production, logistics, and service systems. Computer solution of optimization problems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233",
      "INDU 211"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 324,
    "Name": "Operations Research II",
    "Credits": "3.5",
    "Description": "Integer programming (IP), including modelling and enumerative algorithms for solving IP problems; post‑optimality analysis. Network flows, dynamic programming and non‑linear programming. Applications in the design and operation of industrial systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "Students who have received credit for INDU 430 may not take this course forcredit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "INDU 323"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 330,
    "Name": "Engineering Management",
    "Credits": "3",
    "Description": "Organizational structures, their growth and change. Motivation, leadership, and group behaviour. Design of alternatives for improving organizational performance and effectiveness. Planning, organization and management of engineering projects. Management for total quality.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282",
      "ENGR 301"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 342,
    "Name": "Logistics Network Models",
    "Credits": "3",
    "Description": "Overview of transportation systems; airlines, railways, ocean liners, cargo, energy transportation and pipelines. Supply chain characterization. Site location. Distribution planning. Vehicle routing. Fleet scheduling. Crew scheduling. Demand management. Replenishment management. Revenue management. Geographic information systems. Real‑time network control issues. Project.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for INDU 442 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "INDU 324"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 371,
    "Name": "Stochastic Models in Industrial Engineering",
    "Credits": "3",
    "Description": "Overview of probability theory; probability distributions; exponential model and Poisson process; discrete‑time and continuous‑time Markov chains; classification of states; birth and death processes; queuing theory. Application to industrial engineering problems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 372,
    "Name": "Quality Control and Reliability",
    "Credits": "3",
    "Description": "Importance of quality; total quality management; statistical concepts relevant to process control; control charts for variables and attributes; sampling plans. Introduction to reliability models and acceptance testing; issues of standardization.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 410,
    "Name": "Safety Engineering",
    "Credits": "3",
    "Description": "This course focuses on the following topics: engineering design for the control of workplace hazards; occupational injuries and diseases; codes and standards; Workplace Hazardous Materials Information Systems (WHMIS); hazard evaluation and control; design criteria; risk assessment; safety in the manufacturing environment; applications in ventilation, air cleaning, noise and vibration.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 311/MIAE 311",
      "MIAE 312"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 411,
    "Name": "Computer Integrated Manufacturing",
    "Credits": "3.5",
    "Description": "This course focuses on concepts and benefits of computer integrated manufacturing (CIM); design for manufacturing; computer‑aided design, process planning, manufacturing (computer numerical control parts programming), and inspection; robots in CIM; production planning and scheduling in CIM; system integration.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 311/MIAE 311",
      "MIAE 312"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 412,
    "Name": "Human Factors Engineering",
    "Credits": "3.5",
    "Description": "Elements of anatomy, physiology, and psychology; engineering anthropometry; human capacities and limitations; manual material handling; design of workplaces; human‑machines system design; design of controls and displays; shift work. Applications to a manufacturing environment.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 421,
    "Name": "Facilities Design and Material Handling Systems",
    "Credits": "3.5",
    "Description": "An introduction to planning and design of production and manufacturing. Facility layout and location. Material handling systems and equipment specifications. Computer‑aided facilities planning.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 311",
      "INDU 320"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 423,
    "Name": "Inventory Control",
    "Credits": "3.5",
    "Description": "This course provides the fundamentals of inventory control and management within a company and its impact on the supply chain. The implications of inventory control decisions on production, distribution and logistics operations are emphasized. The methods of reducing inventory holding costs while providing an effective product availability are covered. The topics covered include an introduction to role of inventories and associated costs in a firm, optimal lot sizing and safety stock decisions, coordinated replenishment of items; perishable inventories, supply chain management.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 320"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 424,
    "Name": "Introduction to Enterprise Resource Planning",
    "Credits": "3",
    "Description": "This course covers the essential principles and techniques for the design and applications of Enterprise Resource Planning (ERP) systems. ERP has become an integral part of medium- to large-size companies in today’s competitive world of business. ERP systems integrate different functions across various departments of a company in one system to meet all business process requirements quicker, more accurately and efficiently. The course describes the requirements of ERP systems followed by the introduction of ERP modules on Materials Management, Production Planning, Sales and Distribution, and Financial Accounting and Controlling. Various applications are illustrated using SAP ERP.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 320"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 431,
    "Name": "Quantitative Methods in Health‑care Systems",
    "Credits": "3",
    "Description": "Topics include mathematical modelling and optimization methods in health‑care problems, health‑care staff planning and scheduling, operating room management, appointment scheduling in clinics, production and delivery of radio‑pharmaceuticals, resource allocation and capacity planning in hospitals, ambulance redeployment and dispatching, routing and scheduling of caregivers in home‑health industries, health‑care facility location, inventory management of blood products, kidney exchange optimization and optimization in radiation therapy (IMRT and VMAT). A project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 441,
    "Name": "Introduction to Six Sigma",
    "Credits": "3",
    "Description": "Overview of the Six Sigma concepts and tools. Six Sigma deployment practices: Define, Measure, Analyze, Improve and Control phases (DMAIC). Project development, and the DMAIC problem‑solving approach. Project.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 466,
    "Name": "Decision Models in Service Sector",
    "Credits": "3",
    "Description": "Introduction to service strategy and operations. Service demand forecasting and development of new services. Service facility location and layout planning. Applications of decision models in service operations and service quality control. Cost analysis, queuing models, risk management and resource allocation models for service decisions. Service outsourcing and supply chain issues. Efficiency and effectiveness issues in different service sectors such as emergency force deployment, municipal resource allocation and health care. Case studies using operations research, operations management, and statistical techniques.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 371",
      "INDU 320"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 475,
    "Name": "Advanced Concepts in Quality Improvement",
    "Credits": "3",
    "Description": "Statistical experimental design issues such as randomized blocks, factorial designs at two levels, applications on factorial designs, building models, Taguchi methods.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 372"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 480,
    "Name": "Cases in Industrial Engineering",
    "Credits": "3",
    "Description": "This course uses the case teaching method to train industrial engineering students to analyze real‑ world situations using the tools of operations research. Students assume the roles of engineering consultants working together to solve a problem posed by the client in each case. As a consequence, students obtain experience dealing with all steps involved in solving a real problem, from identification of stakeholders, problem formulation and identification of data requirements, to model implementation and analysis of results. Students are required to participate in class discussions of the case and to present their solutions in either report or presentation form.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "INDU 311/INDU 324"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 490,
    "Name": "Capstone Industrial Engineering Design Project",
    "Credits": "6",
    "Description": "This course includes a supervised design, simulation or experimental capstone design project including a preliminary project proposal with complete project plan and a technical report at the end of the fall term, and a final report by the group and individual oral presentation at the end of the winter term.",
    "Components": [
      "Lecture 1 hour per week, one term"
    ],
    "Notes": [
      "Students will work in groups under direct supervision of a faculty member."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 301",
      "MIAE 380",
      "INDU 421"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "INDU",
    "Number": 498,
    "Name": "Topics in Industrial Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Mechanical, Industrial and Aerospace Engineering Department. The course content may vary from offering to offering and will be chosen to complement the elective courses available in the Industrial Engineering program.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 321,
    "Name": "Properties and Failure of Materials",
    "Credits": "3.5",
    "Description": "This course covers the following topics: the service capabilities of alloys and their relationship to microstructure as produced by thermal and mechanical treatments; tensile and torsion tests; elements of dislocation theory; strengthening mechanisms; composite materials; modes of failure of materials; fracture, fatigue, wear, creep, corrosion; failure analysis; material codes; material selection for design.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory"
    ],
    "Notes": [
      "Students who have received credit for AERO 481 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 221/MIAE 221"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 343,
    "Name": "Theory of Machines",
    "Credits": "3.5",
    "Description": "Introduction to mechanisms; position and displacement; velocity; acceleration; synthesis of linkage; robotics; static force analysis; dynamic force analysis; forward kinematics and inverse kinematics; introduction to gear analysis and gear box design; kinematic analysis of spatial mechanisms.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233/ENGR 243"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 344,
    "Name": "Machine Element Design",
    "Credits": "3",
    "Description": "This course presents the basic principles employed in the design of standard mechanical components such as spur gears, shafts and rolling element bearings subjected to operating force and moment fields. The course highlights the adaptation of theoretical stress relationships to practical design problems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for MECH 441 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 244",
      "MECH 313/MIAE 313",
      "MECH 343"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 351,
    "Name": "Thermodynamics II",
    "Credits": "3.5",
    "Description": "Brief review of ideal gas processes. Semi‑perfect gases and the gas tables. Mixtures of gases, gases and vapours, air conditioning processes. Combustion and combustion equilibrium. Applications of thermodynamics to power production and utilization systems: study of basic and advanced cycles for gas compression, internal combustion engines, power from steam, gas turbine cycles, and refrigeration. Real gases.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 251"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 352,
    "Name": "Heat Transfer I",
    "Credits": "3.5",
    "Description": "Analytical and numerical methods for steady‑state and transient heat conduction. Empirical and practical relations for forced‑ and free‑convection heat transfer. Radiation heat exchange between black bodies, and between non‑black bodies. Gas radiation. Solar radiation. Effect of radiation on temperature measurement.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 311/ENGR 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 361,
    "Name": "Fluid Mechanics II",
    "Credits": "3.5",
    "Description": "This course covers elements of fluid mechanics, building on topics introduced in ENGR 361. Topics include the mechanical properties of fluids and the concepts of stress and strain in fluid mechanics. The continuity equation is discussed. The stream function, velocity potential and vorticity are introduced as well as potential irrotational flows. The Navier-Stokes Equations and their elementary solutions are discussed. Students are introduced to laminar and turbulent flows, flows around solid bodies, boundary layers, separation and wakes. Finally, compressible flows are introduced.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 368,
    "Name": "Electronics for Mechanical Engineers",
    "Credits": "3.5",
    "Description": "This course covers the following topics: voltage and current dividers, voltage and current sources, Thevenin and Norton equivalent sources; semiconductors and diodes; amplifiers and switches; operational amplifiers; digital logic components and circuits (flip-flops, registers, memories, MUX/DEMUX, etc.); digital systems; digital communication and computer architecture.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "Electrical Engineering and Computer Engineering students may not take this course for credit.",
      "Students who have received credit for MECH 470 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "PHYS 205",
      "MIAE 215"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 370,
    "Name": "Modelling and Analysis of Dynamic Systems",
    "Credits": "3.5",
    "Description": "Definition and classification of dynamic systems and components. Modelling of dynamic systems containing individual or mixed mechanical, electrical, fluid and thermal elements. Block diagrams representation and simulation techniques using MATLAB/Simulink. Time domain analysis.Transient and steady-state characteristics of dynamic systems. Linearization. Transfer functions. Introduction to feedback control systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "Students who have received credit for ELEC 370 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "PHYS 205",
      "ENGR 213",
      "ENGR 243/ENGR 245",
      "ENGR 311"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 371,
    "Name": "Analysis and Design of Control Systems",
    "Credits": "3.75",
    "Description": "This course deals with the fundamental principles of control systems. The course develops the basic understanding of control system theory and its role in engineering design. Students are exposed to many practical problems and their solutions. The laboratory work presents the opportunity to experiment with actual control systems hardware. This course covers the following topics: Stability of linear feedback systems; root‑locus method; frequency response concepts; feedback system design using root locus techniques; compensator concepts and configurations; PID‑controller design; simulation and computer‑aided controller design using Matlab/Simulink.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 3 hours per week, alternate weeks"
    ],
    "Notes": [
      "Students who have received credit for ELEC 372 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 311",
      "MECH 370"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 373,
    "Name": "Instrumentation and Measurements",
    "Credits": "3.5",
    "Description": "This course covers the following topics: unified treatment of measurement of physical quantities; static and dynamic characteristics of instruments (calibration, linearity, precision, accuracy, and bias and sensitivity drift); sources of errors; error analysis; experiment planning; data analysis techniques; principles of transducers; signal generation, acquisition and processing; principles and designs of systems for measurement of position, velocity, acceleration, pressure, force, stress, temperature, flow-rate, and proximity detection. The course includes demonstration of various instruments.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for MECH 411 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENGR 311",
      "AERO 371/MECH 370"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 375,
    "Name": "Mechanical Vibrations",
    "Credits": "3.5",
    "Description": "This course covers the following topics: transient and steady-state vibrations under periodic, impulsive shock and arbitrary excitation; multi‑degree-of-freedom systems (free and forced response, influence coefficients, orthogonality principle, and numerical methods); introduction to free vibrations of prismatic bars; Lagrange’s equations; vibration measurement and control.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": [
      "Students who have received credit for MECH 443 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "AERO 371/MECH 370"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 390,
    "Name": "Mechanical Engineering Design Project",
    "Credits": "3.5",
    "Description": "This course covers the following topics: the design process; product cost, quality and time to market, open and concept design problems, problem description; geometric and type synthesis; direct and inverse design problems; material selection and load determination; mathematical modelling, analysis, and validation; introduction to Computer‑Aided Design and Engineering (CAD and CAE); product evaluation for performance, tolerance, cost, manufacture, assembly, and other measures; design documentation. A team‑based design project is an intrinsic part of this course.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282",
      "MECH 311/MIAE 311",
      "MECH 343",
      "MIAE 312/MIAE 380",
      "MECH 344"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 412,
    "Name": "Computer‑Aided Mechanical Design",
    "Credits": "3.5",
    "Description": "This course is an introduction to computational tools in the design process. The following topics are covered: introduction to the fundamental approaches to computer‑aided geometric modelling, physical modelling and engineering simulations; establishing functions and functional specifications with emphasis on geometric tolerancing and dimensioning, manufacturing and assembly evaluation.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 313/MIAE 313"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 414,
    "Name": "Computer Numerically Controlled Machining",
    "Credits": "3.5",
    "Description": "This course focuses on computer‑aided design and manufacturing (CAD/CAM) hardware and software. The following topics are covered: essentials of Computer Numerical Control (CNC) machine tools and systems; process planning and tooling systems for CNC machining, theory of CNC programming of sculptured parts; multi‑axis CNC tool path generation; project using CAD/CAM software; CATIA for complex mechanical parts design and a CNC machine tool to manufacture parts.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 311/MIAE 311",
      "MECH 412",
      "MIAE 312"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 415,
    "Name": "Advanced Programming for Mechanical and Industrial Engineers",
    "Credits": "3",
    "Description": "This course focuses on class definitions. The following topics are covered: designing classes and member functions; constructors and destructors; class libraries and their uses; input and output; data abstraction and encapsulation; introduction to software engineering; computer graphics and visualization; numerical methods; advanced mechanical and industrial engineering applications. This course includes a substantial project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 215/MIAE 215"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 421,
    "Name": "Mechanical Shaping of Metals and Plastics",
    "Credits": "3.5",
    "Description": "This course focuses on metal forming: extrusion, forging, rolling, drawing, pressing, compacting; shear line theory, sheet forming limits; metal cutting, machinability, tooling; plastics shaping: extrusion, moulding, vacuum forming; consideration of the mechanical parameters critical for process control and computer applications; interaction of materials characteristics with processing to define product properties (cold working, annealing, hot working, super plasticity, thermomechanical treatment); energy conservation, safety, product quality, and liability.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 221/MIAE 221"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 422,
    "Name": "Mechanical Behaviour of Polymer Composite Materials",
    "Credits": "3",
    "Description": "This course focuses on general applications of polymer composite materials in aircraft, aerospace, automobile, marine, recreational, and chemical processing industries. The following topics are covered: mechanics of a unidirectional lamina; transformation of stress, strain, modulus, and compliance; off‑axis engineering constants, shear and normal coupling coefficients; in‑plane and flexural stiffness and compliance with different laminates, including cross‑ply, angle‑ply, quasiisotropic, and general bidirectional laminates; hygrothermal effects; strength of laminates and failure criteria; micromechanics.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 233/ENGR 244",
      "MECH 221/MIAE 221"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 423,
    "Name": "Casting, Welding, Heat Treating, and Non‑Destructive Testing",
    "Credits": "3.5",
    "Description": "This course focuses on comparative analysis of the various techniques of casting, welding, powder fabrication, finishing, and non‑destructive testing. The following topics are covered: consideration of the control parameters that are essential to define both automation and robot application; materials behaviour which determines product micro‑structure and properties; technology and theory of solidification, normalizing, quenching, surface hardening, tempering, aging, and thermomechanical processing for steels, cast irons and Al, Cu, Ni and Ti alloys; energy conservation, worker safety, quality control, and product liability.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 221/MIAE 221"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 424,
    "Name": "MEMS — Design and Fabrication",
    "Credits": "3.5",
    "Description": "This course is an introduction to microsystems and devices; mechanical properties of materials used in microsystems; microfabrication and post‑processing techniques; sacrificial and structural layers; lithography, deposition and etching; introduction and design of different types of sensors and actuators; micromotors and other microdevices; mechanical design, finite element modelling; design and fabrication of free‑standing structures; microbearings; special techniques: double‑sided lithography, electrochemical milling, laser machining, LIGA, influence of IC fabrication methods on mechanical properties; application examples in biomedical, industrial, and space technology areas; integration, bonding and packaging of MEMS devices.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 311/MIAE 311",
      "MECH 343",
      "MIAE 312"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 425,
    "Name": "Manufacturing of Composites",
    "Credits": "3.5",
    "Description": "This course focuses on fibres and resins. The following topics are covered: hand lay up; autoclave curing; compression molding; filament winding; resin transfer molding; braiding. Injection molding; cutting; joining; thermoset and thermoplastic composites; Polymer Nanocomposites; process modelling and computer simulation; non‑destructive evaluation techniques.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 311/MIAE 311",
      "MIAE 312"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 426,
    "Name": "Stress and Failure Analysis of Machinery",
    "Credits": "3",
    "Description": "Analysis of stresses, strains and deformations in machine elements; non‑symmetric bending of beams; shear centre for thin‑walled beams; curved beams; torsion of non‑circular shafts and tubes; thick wall cylinders; plates and shells; contact elements; stress concentrations; energy methods; failure modes, analysis and prevention; buckling, fracture, fatigue and creep.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 233/ENGR 244",
      "AERO 481/MECH 321"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 428,
    "Name": "Failure Analysis of Machine Systems",
    "Credits": "3",
    "Description": "This course presents the failure analysis principles employed in the design of mechanical components such as belt and chain drives, helical and bevel gears, bolted and welded joints subjected to operating force and moment fields. The course highlights advanced topics of mechanical components to practical design problems. Students are required to complete assignments including tests, examinations and a course project as a means of assessing their ability to apply the generic approaches discussed to real-life mechanical engineering design problems.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 344"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 444,
    "Name": "Guided Vehicle Systems",
    "Credits": "3",
    "Description": "Definition and classification of guided transportation systems. Track characterization: alignment, gage, profile, and cross‑level irregularities. Wheel‑rail interactions: rolling contact theories, creep forces. Modelling of guided vehicle components: wheel set, suspension, truck and car body configurations, suspension characteristics. Performance evaluation: stability hunting, ride quality. Introduction to advanced vehicles.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 375"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 447,
    "Name": "Fundamentals of Vehicle System Design",
    "Credits": "3",
    "Description": "This course covers the following topics: tire mechanics; performance characteristics of road vehicles such as maximum acceleration, velocity and gradability; driving condition diagrams; brake system design, braking performance, ideal braking force distribution, braking efficiency, and antilock braking system; handling characteristics, steady-state and transient responses to steering inputs, transient measurement methods, and directional stability; ride analysis, suspension system design and modelling, and simple ride models. This course includes case studies using CarSim and mini projects.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 343/MECH 375"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 451,
    "Name": "Renewable Energy: Fundamentals and Applications",
    "Credits": "3",
    "Description": "This course introduces the fundamental aspects and the main applications of renewable energy systems. The focus is on the thermodynamics, heat transfer and fluid mechanics aspects of renewable energy systems. The course covers the following topics: review of thermodynamics, review of heat transfer, review of fluid mechanics, solar energy, wind energy, hydropower, geothermal energy, biomass energy, ocean energy and hydrogen and fuel cells.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 351/MECH 352/MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 452,
    "Name": "Heat Transfer II",
    "Credits": "3.5",
    "Description": "Heat exchangers. Condensation and boiling heat transfer. Principles of forced convection. Analysis of free convection from a vertical wall. Correlations for free convection in enclosed spaces. Mass transfer. Special topics of heat transfer.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 351/MECH 352/MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 453,
    "Name": "Heating, Ventilation and Air Conditioning Systems",
    "Credits": "3",
    "Description": "This course covers the following topics: heating and cooling load calculation; overview of heating and air conditioning systems; review of vapour compression refrigeration cycles, refrigerant properties, and psychometrics; performance characteristics of components (evaporators, condensers, compressors, and throttling devices, such as expansion valves and capillary tubes); system performance characteristics (calculation of system operating conditions based on the capacities of its components and outdoor and indoor conditions); defrosting; estimation of energy consumption for heating with heat pumps; fundamentals of refrigerant piping, water piping, and air distribution systems.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 454,
    "Name": "Vehicular Internal Combustion Engines",
    "Credits": "3",
    "Description": "Mechanical design of vehicular engines for different applications. Gas exchange and combustion engine processes. Combustion chambers design. Fuels for vehicular engines. Fuel supply, ignition and control systems. Cooling and lubrication of engines. Emissions formation and control. Engines’ operational characteristics — matching with vehicles. Enhancement of engine performance. Engine testing. Environmental impact of vehicular engines on global pollution. Recent developments in energy efficient and “clean” engines. Design or calculation project of vehicular engine.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 351/MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 460,
    "Name": "Finite Element Analysis",
    "Credits": "3.75",
    "Description": "Formulation and application of the finite element method to modelling of engineering problems, including stress analysis, vibrations, and heat transfer. Examples illustrating the direct approach, as well as variational and weighted residual methods. Elements and interpolation functions. Meshing effect. Error analysis. One‑ and two‑dimensional boundary value problems. Development of simple programs and direct experience with general purpose packages currently used in industry for design problems.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 3 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 244/ENGR 391"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 461,
    "Name": "Gas Dynamics",
    "Credits": "3.5",
    "Description": "Review of one‑dimensional compressible flow. Normal and oblique shock waves; Prandtl‑Meyer flow; combined effects in one‑dimensional flow; non‑ideal gas effects; multi‑dimensional flow; linearized flow; method of characteristics. Selected experiments in supersonic flow, convergent‑divergent nozzles, hydraulic analog and Fanno tube.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 361"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 463,
    "Name": "Fluid Power Control",
    "Credits": "3.5",
    "Description": "This course is an introduction to fluid power; pneumatic devices; fluidic devices; hydraulic system components; hydraulic and electro‑hydraulic systems; dynamic performance of fluid power systems; fluid logic.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 361",
      "MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 468,
    "Name": "Wind Turbine Engineering",
    "Credits": "3",
    "Description": "This course is designed to cover the theoretical and practical areas pertinent to the operation of wind turbines. The following topics are covered: energy in the wind; aerodynamic drag and lift of turbine blades; horizontal axis and vertical axis wind turbine designs; generators; control systems; mechanical load analysis such as blade, tower, generator and gearbox; blade and tower design; turbine braking; economical, environmental and safety aspects.",
    "Components": null,
    "Notes": [
      "Students who have received credit for MECH 462 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 343/MECH 361",
      "MECH 344/MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 471,
    "Name": "Microcontrollers for Mechatronics",
    "Credits": "3.5",
    "Description": "Introduction to the concepts and practices of microcontrollers and their application for the control of electromechanical devices and systems. Study of the internal architecture of microcontrollers; programming in assembly language for specific microcontroller functions and controller algorithms; timing of the microcontroller and interfacing with peripheral devices. Students undertake hands‑on project work by controlling the position or speed of a DC motor with a feed‑back sensor.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 311",
      "MECH 368"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 472,
    "Name": "Mechatronics and Automation",
    "Credits": "3.5",
    "Description": "This course focuses on design and analysis of mechatronic and automation systems. The following topics are covered: selection and integration of actuators, sensors, hardware, and software; computer vision; programming and software design for mechatronic systems; modelling and simulation; design of logic control systems; finite state machine methods; feedback control and trajectory generation; safety logic systems; case studies including automation systems, mobile robots, and unmanned vehicle systems.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 215/MIAE 215",
      "MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 473,
    "Name": "Control System Design",
    "Credits": "3.5",
    "Description": "Analog and digital controller designs. Analog controllers: lead/lag compensators, pole placement, model matching, two‑parameter configuration, plant input/output feedback configuration. Digital controllers: difference equations, Z‑transform, stability in the Z‑domain, digital implementation of analog controllers, equivalent digital plant method, alias signals, selection of sampling time. Introduction to analog/digital state‑space: controllability, observability, state feedback, state estimator. PI and PID controllers. Simulink assignments and project. Hardware laboratory project: analog and digital controller design for motor with inertial plus generator load.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 372/MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 474,
    "Name": "Mechatronics",
    "Credits": "3.75",
    "Description": "Introduction to mechatronics; basic elements of mechatronic systems. Measurement systems: including principles of measurement systems; sensors and transducers; signal conditioning processes and circuits; filters and data acquisition. Actuation systems: mechanical actuation systems and electrical actuation systems. Controllers: control modes; PID controller; performance measures; introduction to digital controllers and robust control. Modelling and analysis of mechatronic systems; performance measures; frequency response; transient response analysis; stability analysis.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 3 hours per week, alternate weeks"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ELEC 372/MECH 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 476,
    "Name": "Generative Design and Manufacturing in Engineering",
    "Credits": "3",
    "Description": "Generative design is a form‑finding process that can mimic nature’s evolutionary approach to design. It can start with design goals and then explore innumerable possible permutations of a solution to find the best option. This course provides fundamental information on generative design and manufacturing in engineering. The core techniques from mathematics to artificial intelligence that are commonly used in the creative industry are discussed. The formal paradigms and algorithms used for generation as well as cloud computing are also covered.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MECH 313/MIAE 313",
      "AERO 390/MECH 390"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 490,
    "Name": "Capstone Mechanical Engineering Design Project",
    "Credits": "6",
    "Description": "This course includes a supervised design, simulation or experimental capstone design project including a preliminary project proposal with complete project plan and a technical report at the end of the fall term; a final report by the group and presentation at the end of the winter term.",
    "Components": [
      "Lecture 1 hour per week, one term",
      "Laboratory 3 hours per week, two terms"
    ],
    "Notes": [
      "Students will work in groups under direct supervision of a faculty member.",
      "With permission of the Department, students may enrol in AERO 490 instead of MECH 490."
    ],
    "Duration": 2,
    "Prerequisites": [
      "ENGR 301",
      "MECH 344/MECH 390"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MECH",
    "Number": 498,
    "Name": "Topics in Mechanical Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Mechanical, Industrial and Aerospace Engineering Department. The course content may vary from offering to offering and will be chosen to complement the elective courses available in a given option or options.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 211,
    "Name": "Mechanical Engineering Drawing",
    "Credits": "3.5",
    "Description": "This course is an introduction to graphic language and design — means and techniques. The following topics are covered: the third and the first angle projections; orthographic projection of points, lines, planes and solids; principal and auxiliary views; views in a given direction; sectional views; intersection of lines, planes and solids; development of surfaces; drafting practices; dimensioning, fits and tolerancing; computer‑aided drawing and solid modelling; working drawings — detail and assembly drawing; design practice; machine elements representation.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week — includes learning of a CAD software",
      "Laboratory 2 hours per week, alternate weeks."
    ],
    "Notes": [
      "Students who have received credit for MECH 211 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 215,
    "Name": "Programming for Mechanical and Industrial Engineers",
    "Credits": "3.5",
    "Description": "This course focuses on writing programs using assignment and sequences; variables and types; operators and expressions; conditional and repetitive statements; input and output; file access; functions; program structure and organization; pointers and dynamic memory allocation; introduction to classes and objects; mechanical and industrial engineering applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for COEN 243 or MECH 215 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 221,
    "Name": "Materials Science",
    "Credits": "3",
    "Description": "This course focuses on relationships between properties and internal structure, atomic bonding; molecular, crystalline and amorphous structures, crystalline imperfections and mechanisms of structural change; microstructures and their development from phase diagrams; structures and mechanical properties of polymers and ceramics; thermal and optical properties of materials.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for MECH 221 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "CHEM 205"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 311,
    "Name": "Manufacturing Processes",
    "Credits": "3",
    "Description": "This course focuses on the fundamentals of manufacturing processes and their limitations, metrology, machine shop practice, safety and health considerations, forming, conventional machining and casting processes, welding and joining, plastic production, and non-conventional machining techniques; sustainable technologies. Laboratory includes instruction and practice on conventional machine tools and a manufacturing project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week, including industrial visits and field trips to local industries"
    ],
    "Notes": [
      "Students who have received credit for MECH 311 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 313/MIAE 313"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 312,
    "Name": "Engineering Design and Manufacturing Processes Lab",
    "Credits": "1",
    "Description": "This laboratory includes instruction and practice on conventional and advanced machine tools and a manufacturing project.",
    "Components": [
      "Laboratory Equivalent to 4 hours per week, alternate weeks"
    ],
    "Notes": [
      "Students who completed MECH 311 or MIAE 311 prior to Summer 2021 cannot take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MIAE 311"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 313,
    "Name": "Machine Drawing and Design",
    "Credits": "3.5",
    "Description": "This course is an introduction to engineering design and design process. The following topics are covered: problem definition, solution formulation, model development and collaboration aspects of design process; the use of drawings and other graphical methods in the process of engineering design; industrial standards and specifications, design of fits, linear and geometrical tolerances. Design projects based on design philosophies will involve design and selection of many standard machine components like mechanical drives, cams, clutches, couplings, brakes, seals, fasteners, springs, and bearings. Drawing representation of standard components is also covered. Design projects are an integral part of this course.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 12 hours total"
    ],
    "Notes": [
      "Students who have received credit for MECH 313 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 211/MIAE 211"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "MIAE",
    "Number": 380,
    "Name": "Product Design and Development",
    "Credits": "3",
    "Description": "This course focuses on development processes and organizations, product planning, identifying customer needs, product specifications, concept generation, concept selection, concept testing, product architecture, industrial design, design for manufacturing, prototyping robust design, patents and intellectual property.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": [
      "Students who have received credit for AERO 444 or INDU 440 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MECH 211/MIAE 211",
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 108,
    "Name": "Computer Science C.Edge Option Reflective Learning I",
    "Credits": "3",
    "Description": "This course is a reflective learning module for students in their related field which is based on their academic requirements and their first C.Edge term.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 208,
    "Name": "Computer Science C.Edge Option Reflective Learning II",
    "Credits": "3",
    "Description": "This course expands on the students’ second C.Edge term in their related field of study to further develop their knowledge and work‑related skills.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 108"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 218,
    "Name": "Fundamentals of Programming",
    "Credits": "3",
    "Description": "Computers and computing: problem solving with computers, basic data types, expressions, assignments, control structures, simple library functions, programmer‑defined functions, arrays of basic types. Basic elements of object‑oriented programming: classes, objects and methods.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "This course may not be taken for credit in the regular undergraduate programs in the Gina Cody School of Engineering and Computer Science.",
      "Students who have received credit for COMP 248 or COEN 243 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 201"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 228,
    "Name": "System Hardware",
    "Credits": "3",
    "Description": "Levels of system abstraction and von Neumann model. Basics of digital logic design. Data representation and manipulation. Instruction set architecture. Processor internals. Assembly language programming. Memory subsystem and cache management. I/O subsystem. Introduction to network organization and architecture.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for SOEN 228 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 248",
      "MATH 203",
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 232,
    "Name": "Mathematics for Computer Science",
    "Credits": "3",
    "Description": "Sets. Propositional logic and predicate calculus. Functions and relations. Elements of number theory. Mathematical reasoning. Proof techniques: direct proof, indirect proof, proof by contradiction, proof by induction.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for COMP 238 or COEN 231 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 203",
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 233,
    "Name": "Probability and Statistics for Computer Science",
    "Credits": "3",
    "Description": "Combinatorics. Axioms of probability. Conditional probability. Discrete and continuous probability distributions. Expectation and moments. Hypothesis testing. Parameter estimation. Correlation and linear regression. Applications to computer science.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for BIOL 322, ENGR 371, STAT 249, STAT 250, COMM 215, MAST 221, MAST 333 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 205"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 248,
    "Name": "Object‑Oriented Programming I",
    "Credits": "3.5",
    "Description": "Introduction to programming. Basic data types, variables, expressions, assignments, control flow. Classes, objects, methods. Information hiding, public vs. private visibility, data abstraction and encapsulation. References. Arrays.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 249,
    "Name": "Object‑Oriented Programming II",
    "Credits": "3.5",
    "Description": "Design of classes. Inheritance. Polymorphism. Static and dynamic binding. Abstract classes. Exception handling. File I/O. Recursion. Interfaces and inner classes. Graphical user interfaces. Generics. Collections and iterators.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 248",
      "MATH 203",
      "MATH 205"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 326,
    "Name": "Computer Architecture",
    "Credits": "3",
    "Description": "Computer architecture models: control‑flow and data‑flow. Concurrency and locality, data dependency theory. Instruction level parallelism. Instruction scheduling. Pipelined processors. Vector processors. Thread level parallelism. Multiprocessors. Shared memory models. Coherence protocols. Interconnection networks. Performance issues. Advanced topics in contemporary computer architectures.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 333,
    "Name": "Data Analytics",
    "Credits": "4",
    "Description": "This course introduces the process of data analytics with the aid of examples from several disciplines. It covers data wrangling: extract-transform-load (ETL), cleaning, structuring, integration; data analytics activities: description, prescription, modelling, simulation, optimization, storytelling; and the Python ecosystem: language, libraries, and Jupyter environment.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 233/ENGR 371",
      "COMP 352",
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 335,
    "Name": "Introduction to Theoretical Computer Science",
    "Credits": "3",
    "Description": "Finite state automata and regular languages. Push‑down automata and context‑free languages. Pumping lemmas. Applications to parsing. Turing machines. Undecidability and decidability.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 232/COEN 231",
      "COMP 249/COEN 244"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 339,
    "Name": "Combinatorics",
    "Credits": "3",
    "Description": "General principles of counting, permutations, combinations, identities, partitions, generating functions, Fibonacci numbers, Stirling numbers, Catalan numbers, principle of inclusion‑exclusion. Graphs, subgraphs, isomorphism, Euler graphs, Hamilton paths and cycles, planar graphs, Kuratowski’s Theorem, trees, colouring, 5‑colour theorem, matching, Hall’s theorem.",
    "Components": [
      "Lecture",
      "Tutorial"
    ],
    "Notes": [
      "Students who have received credit for MATH 339 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 232"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 345,
    "Name": "Advanced Program Design with C\u002B\u002B",
    "Credits": "4",
    "Description": "Introduction to C\u002B\u002B. I/O with stream classes. Pointers and their uses. The Standard Template Library (STL): containers, algorithms, iterators, adaptors, function objects. Class design: constructors, destructors, operator overloading, inheritance, virtual functions, exception handling, memory management. Advanced topics: libraries, locales, STL conventions, concurrency, template metaprogramming. Applications of C\u002B\u002B: systems, engineering, games programming. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 346,
    "Name": "Operating Systems",
    "Credits": "4",
    "Description": "Fundamentals of operating system functionalities, design and implementation. Multiprogramming: processes and threads, context switching, queuing models and scheduling. Interprocess communication and synchronization. Principles of concurrency. Synchronization primitives. Deadlock detection and recovery, prevention and avoidance schemes. Memory management. Device management. File systems. Protection models and schemes.",
    "Components": [
      "Lecture 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for COEN 346 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 228/SOEN 228",
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 348,
    "Name": "Principles of Programming Languages",
    "Credits": "3",
    "Description": "Survey of programming paradigms: Imperative, functional, and logic programming. Issues in the design and implementation of programming languages. Declaration models: binding, visibility, and scope. Type systems, including static and dynamic typing. Parameter passing mechanisms. Hybrid language design.",
    "Components": [
      "Lecture 2 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 249"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 352,
    "Name": "Data Structures and Algorithms",
    "Credits": "3",
    "Description": "Abstract data types: stacks and queues, trees, priority queues, dictionaries. Data structures: arrays, linked lists, heaps, hash tables, search trees. Design and analysis of algorithms: asymptotic notation, recursive algorithms, searching and sorting, tree traversal, graph algorithms.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for COEN 352 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 232",
      "COMP 249"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 353,
    "Name": "Databases",
    "Credits": "4",
    "Description": "Introduction to database management systems. Conceptual database design: the entity‑relationship model. The relational data model and relational algebra: functional dependencies and normalization. The SQL language and its application in defining, querying, and updating databases; integrity constraints; triggers. Developing database applications. Other data models: Datalog. Object‑oriented data model and ODL. Semi‑structured data. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 232/COEN 231",
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 354,
    "Name": "Introduction to Software Engineering",
    "Credits": "4",
    "Description": "Software development process models (e.g. linear vs. iterative). Project management; roles, activities and deliverables for each software life cycle phase. Requirements management: analysis, elicitation, and scope. Architecture, design and the mapping of requirements to design and design to implementation. Traceability. Software quality assurance: verification, validation and the role of testing. Maintenance and evolution. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hour per week"
    ],
    "Notes": [
      "Students who have received credit for SOEN 341 may not take this course for credit. Students in the BEng in Software Engineering program may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 352",
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 361,
    "Name": "Elementary Numerical Methods",
    "Credits": "3",
    "Description": "Vector and matrix norms. Numerical methods for solving linear systems, Gaussian elimination, LU decomposition, error analysis. Numerical solution of nonlinear equations, Newton’s method, fixed point iterations. Interpolation and approximation, Taylor, Lagrange, Chebyshev and Legendre polynomials. Cubic spline interpolation. Numerical differentiation, numerical integration, Gauss quadrature. Discrete least‑squares approximation. Initial value problems in ordinary differential equations, stiff differential equations. Boundary value problems in ordinary differential equations.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": [
      "Students who have received credit for ENGR 391 or MAST 334 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 232/COMP 249"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 367,
    "Name": "Techniques in Symbolic Computation",
    "Credits": "3",
    "Description": "This course is an application-oriented introduction to algebraic methods involved in symbolic computation, as it applies to number theory and modular algebra, and covering the following topics: numbers, primes, modular arithmetic, Diophantine equations; congruence classes and applications, finite fields and rings; Fermat’s and Euler’s theorems; Chinese Remainder theorem and applications; polynomial congruences and rings. Applications to: error-correcting codes (Humming codes), Hill Cryptosystem, public key encryption schemes, polynomial factorization, polynomial interpolation. A symbolic computation system (e.g. MAPLE), is used as a computational tool and a platform for writing all assignments and tests but not as an object of study itself.",
    "Components": [
      "Lecture"
    ],
    "Notes": [
      "Students who have received credit for MAST 332 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MAST 217/COMP 232",
      "COMP 248"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 371,
    "Name": "Computer Graphics",
    "Credits": "4",
    "Description": "Introduction to computer graphics and graphics hardware. Introduction to graphics API and graphics systems architecture. Mathematics of 2D and 3D transformations, and 2D and 3D viewing. Colour and basic rendering algorithms. Visual realism and visibility. Illumination and shading, global illumination techniques, and textures. Introduction to curves and surfaces, and 3D object modelling. Introduction to computer animation. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 232/COEN 231",
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 376,
    "Name": "Introduction to Game Development",
    "Credits": "4",
    "Description": "Introduction to design and implementation aspects of computer gaming: basic game design, storytelling and narratives, and game genres. Virtual environments, 2D and 3D game engines, and game development tools. Character development, gameplay strategies, level design in games, and user interfaces. Architecture of game consoles, analog and digital controllers, and the incorporation of graphics, sound, and music in game implementations. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 425,
    "Name": "Computer Vision",
    "Credits": "4",
    "Description": "This course introduces basic techniques and concepts in computer vision including image formation, grouping and fitting, geometric vision, recognition, perceptual organization, and the state‑of‑the art software tools. Students learn fundamental algorithms and techniques, and gain experience in programming vision‑based components; in particular, how to program in OpenCV, a powerful software interface used to process data captured from passive and active sensors. A project is required.",
    "Components": [
      "Laboratory 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for this topic under a COMP 498 or COMP 499 number may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 426,
    "Name": "Multicore Programming",
    "Credits": "4",
    "Description": "Fundamental concepts of computer architecture. Architecture of the selected multicore platform. Review of shared‑memory parallel programming. The difficulties inherent to parallel programming. Scalability of programming models. The stream programming model for multicore. Implicit and explicit threading. Implicit and explicit orchestration of data movement, both on chip and off. Adapting standard algorithms to multicore. Critical assessment of the available system‑software support. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346/COEN 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 428,
    "Name": "Parallel Programming",
    "Credits": "4",
    "Description": "Parallel programming techniques as a natural extension to sequential programming. Overview of parallel programming architectures and models. Parallel programming issues: locality, granularity, scheduling, data decomposition and distribution, load balancing, communication and synchronization, determinacy and non‑determinacy, cost and performance. Techniques and tools for message‑passing parallel programming. Case studies. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346/COEN 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 432,
    "Name": "Machine Learning",
    "Credits": "4",
    "Description": "This course introduces conceptual and practical aspects of machine learning. Concepts include regression, classification, maximum likelihood estimation, discriminative vs. generative modelling, generalization, supervised learning, unsupervised learning, semi-supervised learning and transfer learning. Methods include linear models, mixture models, nearest neighbours, support vector machines, random forests, boosting, and basics of deep learning. A project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 433,
    "Name": "Introduction to Deep Learning",
    "Credits": "4",
    "Description": "This course introduces conceptual and practical aspects of deep learning and their implementation in software. Topics covered include commonly used deep learning model architectures, loss functions, regularization, optimization methods, and a strong emphasis is placed on review of their foundations and use of software tools such as pytorch, jax, and tensorflow to implement and/or apply these models. Applications in computer vision and natural language processing are covered. A final project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 438,
    "Name": "Geometric Modelling and Processing",
    "Credits": "4",
    "Description": "This course exposes students to the geometric modelling pipeline. It includes topics such as efficient mesh data structures such as half-edge and cornertable, digital differential geometry, spectral mesh processing, discrete modelling tools and analytic modelling tools (B-Splines, Bezier and subdivision surfaces), optimization-driven modelling and simulation, 3D shape acquisition, 3D printing and prototyping. Application-related topics are discussed such as smoothing, resampling, compression, as well as deep neural network architectures for geometric data and modelling problems. A project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 442,
    "Name": "Compiler Design",
    "Credits": "4",
    "Description": "Compiler organization and implementation: lexical analysis and parsing, syntax‑directed translation, code optimization. Run‑time systems. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 228/SOEN 228/COEN 311",
      "COMP 335",
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 444,
    "Name": "System Software Design",
    "Credits": "4",
    "Description": "Detailed examination of the design, implementation and system call interface of a contemporary operating system: its kernel, file system, process and thread management including scheduling, file system design and implementation, memory management, device management, I/O management, interprocess communication and synchronization mechanisms, system call interface, interrupt handling, and other advanced issues. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 445,
    "Name": "Data Communication and Computer Networks",
    "Credits": "4",
    "Description": "Network architectures: OSI and Internet models. Link layer: error detection, multiple access protocols, addressing. Local area networks: Ethernet, ATM, switches and hubs. Network layer: forwarding and routing, IP, routing algorithms, multicast. Transport layer: connectionless and connection‑oriented transport, reliable data transport, congestion control, QoS, UDP and TCP. Application layer: DNS, the web and http, file transfer, and email. Introduction to network security, multimedia protocols and wireless networking.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 451,
    "Name": "Database Design",
    "Credits": "4",
    "Description": "Storage management. Buffer management. Data organization. Index structures. Query optimization and execution. Transaction management. Recovery. Concurrency control. Database performance analysis and tuning. New trends in database technology. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 353"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 465,
    "Name": "Design and Analysis of Algorithms",
    "Credits": "3",
    "Description": "Order statistics: worst‑case, average‑case and amortized analysis. Algorithm design techniques: greedy algorithms, dynamic programming. Selected algorithms from graph theory, linear programming, number theory, string matching, and computational geometry. A survey of hard problems, NP‑completeness, and approximation algorithms.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 232/COEN 231",
      "COMP 339",
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 472,
    "Name": "Artificial Intelligence",
    "Credits": "4",
    "Description": "This course initially describes the scope and history of Artificial Intelligence. Then it covers knowledge representation, heuristic search, game playing and planning. Finally, it introduces the topics of machine learning, genetic algorithms and natural language processing. A project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 473,
    "Name": "Pattern Recognition",
    "Credits": "4",
    "Description": "Preprocessing. Feature extraction and selection. Similarity between patterns and distance measurements. Syntactic and statistical approaches. Clustering analysis. Bayesian decision theory and discriminant functions. Neural networks and machine learning. Applications. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 474,
    "Name": "Intelligent Systems",
    "Credits": "4",
    "Description": "Rule‑based expert systems, blackboard architecture, and agent‑based. Knowledge acquisition and representation. Uncertainty and conflict resolution. Reasoning and explanation. Design of intelligent systems. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352/COEN 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 475,
    "Name": "Immersive Technologies",
    "Credits": "4",
    "Description": "This course covers the fundamentals of immersive technologies, a brief history and overview of immersive technologies, analyzes case studies of interactive experiences using immersive technologies, and identifies the main challenges of the current state of the art. Furthermore, it covers the basic principles of 3D graphics for creating virtual assets and environments, and basic concepts and technologies for interaction. A project provides hands‑on experience in the design and development of interactive experiences with the user of immersive technologies.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 476,
    "Name": "Advanced Game Development",
    "Credits": "4",
    "Description": "Introduction to advanced aspects of computer games. Game engine design. Artificial Intelligence (AI): non‑player character movement, coordinated movement, pathfinding, world representations; decision making; tactical AI, strategic AI, learning in games. Physics‑based techniques: collision detection and response. Networked gaming: multi‑player games, networking and distributed game design, mobile gaming. Improving realism: cut scenes, 3D sound. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 361/ENGR 391",
      "COMP 376"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 477,
    "Name": "Animation for Computer Games",
    "Credits": "4",
    "Description": "Introduction to the algorithms, data structures, and techniques used in modelling and rendering dynamic scenes. Topics include principles of traditional animation, production pipeline, animation hardware and software, orientation representation and interpolation, modelling physical and articulated objects, forward and inverse kinematics, motion control and capture, key‑frame, procedural, and behavioural animation, camera animation, scripting system, and free‑form deformation. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 361/ENGR 391/COMP 371"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 478,
    "Name": "Image Processing",
    "Credits": "4",
    "Description": "Digital image fundamentals, image transforms (Fourier, Walsh, Haar, Hotelling, wavelet), image enhancement (histogram processing, spatial filtering, high‑ and low‑pass filtering), image restoration, image compression (elements of information theory, image compression models, error‑free compression, lossy compression, image compression standards), image segmentation (line detection, Hough transform, edge detection and linking, thresholding, region splitting and merging), representation and description (chain codes, signatures, skeletons, shape descriptors, moments, texture). Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 479,
    "Name": "Information Retrieval and Web Search",
    "Credits": "4",
    "Description": "Basics of information retrieval (IR): boolean, vector space and probabilistic models. Tokenization and creation of inverted files. Weighting schemes. Evaluation of IR systems: precision, recall, F‑measure. Relevance feedback and query expansion. Application of IR to web search engines: XML, link analysis, PageRank algorithm. Text categorization and clustering techniques as used in spam filtering. Project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 233/ENGR 371",
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 490,
    "Name": "Computer Science Project I",
    "Credits": "3",
    "Description": "Students work on a computer science project under the supervision of a faculty member and submit a suitable written report on the work carried out.",
    "Components": [
      "Lecture"
    ],
    "Notes": [
      "Students can register for COMP 490 by itself or, with the permission of the Department, students can register for COMP 490 and 492 concurrently and carry out a major project."
    ],
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 492,
    "Name": "Computer Science Project II",
    "Credits": "3",
    "Description": "Students work on a computer science project under the supervision of a faculty member and submit a suitable written report on the work carried out.",
    "Components": [
      "Lecture"
    ],
    "Notes": [
      "Students can register for COMP 492 by itself or, with the permission of the Department, students can register for COMP 490 and COMP 492 concurrently and carry out a major project."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 490"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 493,
    "Name": "Computational Biology Team Project",
    "Credits": "6",
    "Description": "Students form teams or join existing teams (such as those in research labs) and work under faculty supervision to solve a computational biology research problem or to carry out a computational biology research project. The research problem or project involves the utilization of knowledge of biology and of computing, involves computing lab and/or wet lab practice and contributes to any of the areas of computational biology. The project fosters teamwork and allows students to develop their project management, technical writing and oral presentation skills.",
    "Components": [
      "Research"
    ],
    "Notes": [
      "Students who have received credit for BIOL 493 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": null
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 495,
    "Name": "Honours Seminar",
    "Credits": "1",
    "Description": "Students are required to attend a number of departmental seminars and submit a written report on them.",
    "Components": [
      "Seminar"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 498,
    "Name": "Topics in Computer Science",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Department. The content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "COMP",
    "Number": 499,
    "Name": "Topics in Computer Science with Lab",
    "Credits": "4",
    "Description": "The content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 228,
    "Name": "System Hardware",
    "Credits": "4",
    "Description": "This course covers the following topics: Boolean Algebra, Digital logic and the design of logic circuits; CPU design; addressing modes; instruction sets and sequencing; design of datapath and control units; memory systems and types; cache memory levels; I/O devices and their interconnection to the CPU; assembly language, and Interrupts.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for COMP 228 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "MATH 203/MATH 204"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 287,
    "Name": "Web Programming",
    "Credits": "3",
    "Description": "This course covers the following topics: internet architecture and protocols; web applications through clients and servers; modern HTML and CSS; client‑side programming using modern JavaScript and an overview of the advantages of some common modern JavaScript libraries; Regular Expressions; static website contents and dynamic page generation through server‑side programming; preserving state (client‑side) in web applications; deploying static and dynamic websites and content management systems vs. website deployment.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 248"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 298,
    "Name": "System Hardware Lab",
    "Credits": "1",
    "Description": "Digital design exercises including assembly and testing corresponding to the SOEN 228 lab.",
    "Components": [
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 321,
    "Name": "Information Systems Security",
    "Credits": "3",
    "Description": "This course covers the following topics: introduction to cryptography and cryptanalysis; threats, attacks, and vulnerabilities; security services (confidentiality, authentication, integrity); public key systems including Diffie‑Hellman, RSA, Rabin; Digital Signature Schemes; Hash functions and MAC schemes; authentication protocols; network layers and security; protocols; Public Key Infrastructure (PKI); Transport Layer Security (TLS); firewalls; Intrusion Detection Systems; DNS security; Denial of Service Attacks; Penetration testing; Online Privacy and anonymity; Mix networks and Onion Routing; TOR; Malware; Botnets; Spam and Hot topics in Security and Privacy.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346/COEN 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 331,
    "Name": "Formal Methods for Software Engineering",
    "Credits": "3",
    "Description": "This course covers the following topics: property‑based (axiomatic and algebraic) formalisms and model‑based (abstract and visual) formalisms; axiomatic formalisms with temporal logic, assertions and contracts; algebraic formalisms through algebraic specifications; abstract formalisms through the Z and Object‑Z specification languages; visual formalisms through automata (finite state machines and extended finite state machines).",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 232/COMP 249"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 341,
    "Name": "Software Process and Practices",
    "Credits": "4",
    "Description": "This course covers the following topics: basic principles of software engineering; introduction to software process, including activities, phases, organization, roles, teamwork, and conflict resolution; notations used in software engineering; software development practices, including documentation, modern version control, review, testing, agile, and continuous integration.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for COMP 354 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 352/COEN 352",
      "ENCS 282"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 342,
    "Name": "Software Requirements and Deployment",
    "Credits": "4",
    "Description": "This course covers the following topics: requirements engineering; eliciting and coping with changing and evolving requirements; deployment of a software system under real‑life functional and non‑functional requirements scenarios; understanding how requirements impact early‑stage and deployed software systems through all phases of engineering, including design, implementation, test and verification, deployment, and evolution. A project is required.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 343,
    "Name": "Software Architecture and Design",
    "Credits": "4",
    "Description": "This course covers the following topics: from requirements to design to implementation; planned vs. evolutionary design and refactoring; model‑driven design and Unified Modelling Language (UML); structural and behavioural design descriptions and specifications; general and domain‑specific design principles, patterns and idioms; introduction to software architecture (styles and view models); design quality; architectural debt; design smells; refactoring Anti‑Patterns to Patterns; design rationale.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 341",
      "SOEN 342"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 344,
    "Name": "Advanced Software Architecture and Design",
    "Credits": "3",
    "Description": "This course covers the following topics: architectural activities, roles, and deliverables; architectural view models; architectural styles (including client‑server, layered, pipes‑and‑filters, event‑based, process control) and frameworks; architectural analysis and the interplay with requirements elicitation; notations for expressing architectural designs, structural and behavioural specifications; from architectural design to detailed design; domain specific architectures and design patterns; evaluation and performance estimation of designs; advanced object‑oriented design patterns and idioms.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 343"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 345,
    "Name": "Software Testing, Verification and Quality Assurance",
    "Credits": "4",
    "Description": "This course covers the following topics: unit testing and test‑driven development; characterization testing and legacy system testing; mocking, dependency injection, and breaking system dependencies; integration and system testing; test planning and management; test order, prioritization, redundancy, and flaky tests; advanced topics including static analysis, bisection, and fuzzing; data migration testing and verification; continuous integration and delivery; DevOps testing and validation including darklaunching, A/B testing, feature toggles, and logging.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 343"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 357,
    "Name": "User Interface Design",
    "Credits": "3",
    "Description": "This course covers the following topics: principles, standards and guidelines for user interface design; usability principles and user experience; standards and design rationale for user‑centred design; task‑centred design; rationalized design; usability engineering; user models; interface design process, including interface requirement gathering, conceptual design and prototyping, and evaluation; usability testing and analytic evaluation; data gathering and analysis techniques for qualitative and quantitative data; interface design documentation; design approaches for touch, gesture‑based, and haptic interfaces.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 341/COMP 354"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 363,
    "Name": "Data Systems for Software Engineers",
    "Credits": "3",
    "Description": "This course covers the following topics: introduction to the current data ecosystem; relational databases; key‑value databases; document databases; column databases; graph databases; RDF stores; parallel and distributed file systems, data processing engines; data stream analytics; and data infrastructure.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 384,
    "Name": "Management, Measurement and Quality Control",
    "Credits": "3",
    "Description": "Organization of large software development. Roles of team members, leaders, managers, stakeholders, and users. Tools for monitoring and controlling a schedule. Financial, organizational, human, and computational resources allocation and control. Project and quality reviews, inspections, and walkthroughs. Risk management. Communication and collaboration. Cause and effects of project failure. Project management via the Internet. Quality assurance and control.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENCS 282",
      "SOEN 341"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 385,
    "Name": "Control Systems and Applications",
    "Credits": "3",
    "Description": "Mathematical modelling of dynamical systems; block diagrams; feedback; open and closed loops. Linear differential equations; time domain analysis; free, forced, and total response; steady state and transient response. Laplace transform and inverse transform; second order systems. Transfer functions and stability. Control system design: PID and root locus techniques. Computer simulation of control systems. Applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "ENGR 213/ENGR 233"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 387,
    "Name": "Web‑Based Enterprise Application Design",
    "Credits": "3",
    "Description": "This course introduces Hypertext Transfer Protocol (HTTP), and client/server and layered architectures for Web-based Enterprise Applications (WEA). The course covers Application, Presentation, Domain and Data Source design patterns. Students learn how to use Java servlets and Java Server Pages. The course also covers authentication, security and transaction processing, as well as system-level testing of web applications.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 353/SOEN 363",
      "COMP 354/SOEN 341",
      "SOEN 287"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 390,
    "Name": "Software Engineering Team Design Project",
    "Credits": "3.5",
    "Description": "Students work in teams to design and implement a software project from requirements provided by the coordinator. Each team will demonstrate the software and the testing of the software, and prepare adequate documentation for it. In addition, each team will generate a report based on the process of development.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 345/SOEN 357"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 422,
    "Name": "Embedded Systems and Software",
    "Credits": "4",
    "Description": "This course covers the following topics: embedded computer system architectures; programming of interface and peripheral control registers; analog to digital conversion and motor control using pulse width modulation; interrupts, communication methods and their application to interface control and multi‑computer systems; architecture and operating systems of advanced embedded designs; design and testing of integrated systems; advanced topics.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": [
      "Students who have received credit for COEN 421 may not take this course for credit."
    ],
    "Duration": 1,
    "Prerequisites": [
      "COMP 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 423,
    "Name": "Distributed Systems",
    "Credits": "4",
    "Description": "This course covers the following topics: principles of distributed computing including scalability, transparency, concurrency, consistency, fault tolerance, high availability; client‑server interaction technologies including interprocess communication, sockets, group communication, remote procedure call, remote method invocation, object request broker, web services; server design techniques including process replication, fault tolerance through passive replication, high availability through active replication, coordination and agreement, transactions and concurrency control.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 346"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 448,
    "Name": "Management of Evolving Systems",
    "Credits": "3",
    "Description": "This course covers the following topics: software maintenance (corrective, perfective, and adaptive); software reuse; construction of reusable software; techniques for reverse engineering and re‑engineering software; software development as “growing” software; long‑term evolution of existing software systems.",
    "Components": [
      "Lecture 3 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 342/SOEN 343"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 471,
    "Name": "Big Data Analytics",
    "Credits": "4",
    "Description": "This course focuses on the fundamentals of the big data terminology, concepts and technologies. For the technical aspects of big data management systems, the course focuses on big data engines, programming models and file systems. Specific techniques covered include supervised classification, recommender systems, data clustering, frequent itemsets mining, similarity search, data streams and graph analysis. A project provides extensive hands-on experience.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "COMP 352"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 487,
    "Name": "Web Services and Applications",
    "Credits": "4",
    "Description": "This course covers the following topics: analysis and design of web services and applications; advanced architectures for the design, deployment, and testing of large multi‑server web services and applications; Service Oriented Architecture (SOA); Electronic Commerce; security; load balancing; stress testing.",
    "Components": [
      "Lecture 3 hours per week",
      "Tutorial 1 hour per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 387"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 490,
    "Name": "Capstone Software Engineering Design Project",
    "Credits": "6",
    "Description": "Students work in teams of at least four members to construct a significant software application. The class meets at regular intervals. Team members will give a presentation of their contribution to the project.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": [
      "SOEN 390"
    ]
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 491,
    "Name": "Software Engineering Project",
    "Credits": "1",
    "Description": "Theoretical or practical project in an advanced topic in software engineering.",
    "Components": [
      "Lecture"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 498,
    "Name": "Topics in Software Engineering",
    "Credits": "3",
    "Description": "This course may be offered in a given year upon the authorization of the Department. The content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "Components": [
      "Lecture 3 hours per week."
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  },
  {
    "CourseId": 0,
    "UniversityId": 1,
    "Type": "SOEN",
    "Number": 499,
    "Name": "Topics in Software Engineering with Lab",
    "Credits": "4",
    "Description": "This course may be offered in a given year upon the authorization of the Department. The content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "Components": [
      "Lecture 3 hours per week",
      "Laboratory 2 hours per week"
    ],
    "Notes": null,
    "Duration": 1,
    "Prerequisites": []
  }
]